[{"body": "I'm going to fly to LA today. I would normally fly United because of miles/upgrades but the Gotham Gal booked this flight and we are going Virgin. I find flying on Virgin like going to a nightclub because of the lighting and I avoid it as a result.\nIt got me thinking about airlines in general. You hear people complain all the time about airlines but you don't hear that many folks talk about airlines they love. As I have some long flights to asia and other far flung parts of the world in my future, I figured it would be fun to talk about the best airlines in the world, instead of the worst.\nThe best airlines I've flown on regularly are British Airways and Lufthansa. If it were up to me, I would fly the international airlines over the US airlines every day of the week.\nHow about you?", "title": "Fun Friday: Favorite Airline"}, {"body": "Dave Morgan is one of my favorite entrepreneurs. We've backed him twice at USV and he is also a very good friend to my and my partners. Dave has been building businesses at the intersection of madison avenue and the internet since the mid 90s. So when he asked me to do a fireside chat at ad:tech with him, I said yes in a nanosecond.\nWe did that chat yesterday and I thought it was a great wide ranging conversation that started with the mid 90s and ended with where we are headed in the coming years. It's long, but if you have an hour to watch/listen, I highly recommend it, particularly the Q&A at the end.", "title": "ad:tech chat with Dave Morgan"}, {"body": "Kasi asked me this last night in the comments:\nFred. Now that... it is all over and done.\nHow do you take the result? Will that be the post for tom'row?\nSo I will take a shot at answering that question.\nI take the result of yesterday's election as a sign that the demographics of the United States are changing and changing fast. The Latino vote in Florida, Colorado, New Mexico, and Nevada has changed those states from red to blue and maybe permanently.\nI also agree with Nate Silver that the President's bailout of the auto industry in 2009 was a huge bet that paid off bigtime yesterday. The blue that ran from Pennsylvania to Wisconsin in the electoral map last night was a sign that the industrial midwest is more comfortable with the President than the private equity guy.\nAnd finally, I think that the war on women that the GOP has been waging for years must stop if they want to be relevant again. It is not OK to include legitimate and rape in the same phrase and it never will be.\nBut where do we go from here?\nThe House is in full control of the Republicans and the Tea Party. They will continue the obstructionist politics that have been the dominant theme in Washington for the past four years. But Mitch McConnell's goal of using those obstructionist politics to deny the President another term did not work and probably cost his party a lot of goodwill in the end. He was the big loser last night as his chance at majority leader was slapped back hard. That was nice to see.\nI am hopeful we will get the grand bargain on defecit reduction that repeals the Bush tax cuts along with $4.5 trillion in spending cuts. We have to have that deal. Our deficits are killing us and our economy. I know this community is full of folks who think you can't tax your way out of ecoonomic problems. But our country enjoyed a great economic run in the Clinton years and repealing the Bush tax cuts will simply take us back to the tax regime that was in place in those years. I hope and pray we can get that grand bargain done now that the President has been given four more years.\nThe other thing that yesterday's election makes perfectly clear is the rising power of the Hispanic community in our country. Their signature issue is immigration reform. So hopefully we will get relief on that issue now. The idea that we can and should close our borders to those who want to work hard and make a better life for their families is abhorrent to me. It is downright unamerican. We need to open our borders to those who want to be hard working citizens of our country and we need to legalize those who have been working hard and acting like good citizens in this country for years.\nThe economy is on the mend. The recovery is the slowest we have had after a recession in many many years. My partner Albert is doing a series of posts on why that is. I highly recommend them. Our economy will continue to expand in the coming years if we take control of the deficit and stop piling debt on top of our economy. We can bring manufacturing jobs back to the US. We can bring service jobs back to the US. We can build on the entrepreneurial spirit of our country and we can compete on a global scale if we just put our heads down and work at it. And it would be best to do that together.\nMy favorite image of the entire campaign is the one of Gov Chris Christie and the President touring the ravaged Jersey shore together. That was dropping our differences and coming together in a time of need. We must have more of that in America. And after last night, I hope and pray that we will.", "title": "How Do You Take The Vote?"}, {"body": "We've witnessed the most expensive presidential election contest in history. If you don't live in one of the eight to ten \"swing states\", it didn't feel like much of an election. I did not see one commercial for either side. But friends who have been in Ohio tell me they have been bombarded for months. Well that's the electoral college for you.\nBut regardless of whether you live in a swing state of not, I urge everyone to go out and vote. I plan to do that bright and early this morning on my way to work. I have no idea how crowded the polls will be so I am going to leave extra time.\nLike much of America, I find it hard to be enthusiastic about either choice this morning. My vote will be a vote against Romney and the GOP more than anything else. I don't subscribe to the GOP's social views and I don't subscribe to the idea that you can fix the fiscal mess without asking those like me who have to the means to do more. I am hoping that once their legislative strategy of \"keeping Obama to four years\" fails, the GOP will meet the Democrats in the middle and find common ground to deal with the messes that all of our elected officials have been entrusted to solve.\nI have thought a lot about the Kid's advice to pull the lever for Gary Johnson, but that doesn't work for me. It's a two horse race and placing the lever for anyone else is a waste of a vote. And I take the job of electing a President too seriously to waste a vote like that.\nBut regardless of how you feel about Romney, Obama, or Gary Johnson, I hope that all of you take the time today to go out and vote. Our system sucks in so many ways, but it is our system and as citizens we have a responsibility to engage in it. Today, that means voting.", "title": "Election Day 2012"}, {"body": "I'd like to tie together two posts and make a final point on Sustainability.\nIn my first post for the Sustainability class, I wrote:\nClay Christensen talks about this kind of thing all the time. Big company executives are asked to calculate an return on investment (ROI) on the investments they want to make. If the ROI isn't greater than some minimum hurdle, the company doesn't make the investment. And so along comes a smaller competitor who makes the investment and they eat the big company's lunch.\nROI is not the right framework for companies to evaluate investments. ROI is for the wall street folks. They will use it to decide if they want to invest in your company. But when you make investment decisions in your company, don't use the tools that wall street uses. Use the tools that animals use. Survival instincts. What will it take to ensure that your company is around in ten years, fifty years, 100 years? That's how to think if you want to stay in business.\nAnd then the man himself, Clay Christensen, went and wrote a post for the NY Times yesterday which I highlighted in yesterday's What I Am Reading post. Clay wrote:\nSo we taught our students how to magnify every dollar put into a company, to get the most revenue and profit per dollar of capital deployed. To measure the efficiency of doing this, we redefined profit not as dollars, yen or renminbi, but as ratios like RONA (return on net assets), ROCE (return on capital employed) and I.R.R. (internal rate of return).\nSince this is called MBA Mondays and we are supposedly teaching a MBA style curriculum, I want to emphasize this point. Do not use Wall Street tools to evaluate investment decisions in your companies. Use the tools that animals use. Survival instincts. What will it take to ensure that your company is around in ten years, fifty years, 100 years? That's how to think if you want to stay in business forever.\nBut Clay's post for the NY Times yesterday makes a broader point. If the folks who allocate capital in our society - venture capitalists, hedge fund managers, mutual fund managers, etc - are using IRR, ROCE, RONA, then they are going to allocate capital to companies that are making efficiency oriented investments, not empowering investments. And our society will continue to be awash in capital with no game changing  empowering investments that create new industries.\nClay suggests that we measure our returns in \"dollars in dollars out\" and forget about time, \" profit as dollars, yen or renminbi\". That's they way I was taught the venture capital business back in the 80s. Cash on cash, dollars in dollars out. That's what matters. If it takes a decade or more, who cares? The slow capital approach.\nSo if MBA Mondays is a school of business, then I hereby outlaw IRR, RONA, ROCE, from our lips. We aren't going to teach those tools and we aren't going to talk about them either. We are going to talk about making money the old fashioned way. In gobs and gobs, but slowly over time, with our survival instincts fully engaged. Let's hope others do the same.", "title": "MBA Mondays: One More Thing On Sustainability Before We Move On"}, {"body": "A Capitalist's Dilemma by Clayton Christensen\nThe Money Quote:\nThe answer is that efficiency innovations are liberating capital, and in the United States this capital is being reinvested into still more efficiency innovations. In contrast, America is generating many fewer empowering innovations than in the past. We need to reset the balance between empowering and efficiency innovations.\nThe Doctrine of New Finance helped create this situation. The Republican intellectualGeorge F. Gilder taught us that we should husband resources that are scarce and costly, but can waste resources that are abundant and cheap. When the doctrine emerged in stages between the 1930s and the '50s, capital was relatively scarce in our economy. So we taught our students how to magnify every dollar put into a company, to get the most revenue and profit per dollar of capital deployed. To measure the efficiency of doing this, we redefined profit not as dollars, yen or renminbi, but as ratios like RONA (return on net assets), ROCE (return on capital employed) and I.R.R. (internal rate of return).\nThe Return Of The Capital Intensive Startup by Albert Wenger\nThe Money Quote:\nHistorically startups were capital intensive because they had to spend a lot of money to build the product and bring it to market before they were able to generate revenues.  Now it seems that everyone believes in network effects and the capital intensity comes from trying to build the biggest network faster than the competition.  The use of capital has thus shifted to customer and/or supplier acquisition or maybe more generally towards network growth.\nThe Network Effect Isn't Good Enough by Nir Eyal and Sangeet Paul Choudary\nThe Money Quote:\nCreating a network effect is not what it used to be. Today, stored value created by the users reinforces the power of the network effect to retain users and grow market share. This dynamic makes creating user habits all the more important as investments of stored value only occur through successive passes through the user experience (see Nir's previous article and video).\nWith the portability of the social graph and the fall of upfront costs to join a network, companies must leverage new ways of acquiring and retaining users. Business models that leverage a network effect plus stored value, hold the keys to the kingdom.\nShow Me Your Badge by Kevin Carey\nThe Money Quote:\nOne of the most important functions of college degrees is signaling knowledge and skill to potential employers. Yet degrees and certificates often do a poor job of communicating detailed information about graduates. Grade inflation has steadily obscured the meaning of G.P.A.'s, and there's no easy way to know what someone who got, for example, an A-minus in Econ 206 actually learned. A badge, on the other hand, is supposed to indicate specific knowledge and skills.\nStack Overflow, an Internet forum with 1.4 million registered users, awards members \"reputation\" points and a variety of badges based on answers to questions posed by fellow computer programmers. Some members devote hundreds of hours to writing and editing posts that are judged by the Stack Overflow community to display high levels of expertise. Tomasz Nurkiewicz, an Oslo software engineer and one of only 88 users to earn a \"Legendary\" Stack Overflow badge, writes, \"I received numerous job offers from people who either saw my profile with reputation and all the badges, or were particularly impressed by one of my answers.\"", "title": "What I'm Reading This Sunday Morning"}, {"body": "About a dozen years ago, the Gotham Gal and I purchased a townhouse in Greenwich Village and did a gut renovation on it. Down in the basement, we built a large data room. There were racks and racks of equipment in this room. There was a home audio system with mp3 servers. There were network attached storage devices for family photos and videos. There was even an exchange server that I had taken from the offices of Flatiron Partners which ran our mail and related systems. It was an impressive room that would raise oohs and aahs from geeks who like that sort of thing. When we sold that house in 2007, we decided to decommission all of that equipment and put everything into the cloud.\nThe home audio system became Sonos units connected to Rhapsody, last.fm, and a number of other cloud based music systems that were available at the time. The family photos and videos went into cloud based file storage systems. The exchange server was scrapped and we all got onto Google Apps.\nI thought of that room when we went back to visit our building on Tuesday in the aftermath of the storm. Our basement was filled with the Hudson River and I shivered to think about that townhouse data room filled with water to the ceiling. Of course that never happened. But what if it did?\nWe do have a data room in the basement of our building which was filled to the ceiling with water this week. But that data room mostly has network switches, routers, cable and DSL modems, and patch panels in it. We have redundant data networks in our home. When we get our basement cleaned up and dry, we will pull all of these switches, routers, amd modems out and replace them with new ones. And we will be back up and running. Because all of our systems are now up in the cloud. And I know they are operating fine. Because all week while we have been displaced from our home, I have been accessing all of them from our friend's home.\nBut it goes even deeper than that. For the next couple months, the Gotham Gal and I and our son will be living somewhere else. I have a home office that for over twenty years has had a windows desktop machine running Quicken on it. I am a bit obsessive about keeping good financial records and files. I thought briefly this week, \"how am I going to manage all this stuff while we are displaced?\" But then I remembered that we moved everything to Quickbooks Online a while back and I can make any place my home office because my data is in the cloud now.\nAnd this applies to our portfolio companies as well. One of the companies I work with went down this week because their primary data center was flooded and has not come back online yet. Their engineering team worked pretty much around the clock to move their primary application to Amazon's cloud so they could get back up and running. As the CEO and I were emailing about this disaster, I mentioned that one good outcome of all of this is that our application is now redundant. We can run it in a data center and/or the cloud. Which of course is a good thing.\nWhether it is a company or a family, moving your applications and your data to the cloud is a great disaster preparation effort. Most companies deal with disaster planning and redundancy when they \"grow up\". But many families do not. This week was an eye opening experience for me about the value of putting your applications and data in the cloud. We did that a while back and it has made being flooded and displaced a lot easier. I cringe to think about what would happen if we had replicated that big data room in the basement of our building. Thankfully we did not.", "title": "Disaster and the Cloud"}, {"body": "Lost in the crazy week that we are having in NYC is that fact that Kickstarter went international this past week. On Wednesday, Kickstarter announced that projects in the UK were now live on the site.\nFolks from around the world have always been able to back Kickstarter projects, but until this week project creators had to be US residents. This is largely a payments issue, but there were a few other factors at work.\nThe good news is now that Kickstarter has gotten a payment system of its own live in the UK, it can more quickly roll out project creation status to other parts of the world. Payments is not something that you can do globally all at once. It is something you have to roll out country by country.\nHere are a bunch of open projects from London. Maybe you'll find one to back. I backed this one because I'm a fan of time travel fiction.", "title": "Feature Friday: Kickstarter Goes International"}, {"body": "The Gotham Gal and I have received countless messages from many of you wishing us well and volunteering all sorts of things. We even were offered use of a 3400 sf apartment on the upper west side! It is very gratifying to know that so many of you are thinking of us and wanting to help.\nThe past few days have been very strange here in NYC. North of 34th street in Manhattan and in most parts of Brooklyn, everything seems quite normal. But downtown manhattan is eerie. There are no working stop lights. Crossing a major avenue is a life threatening experience. Lower manhattan is a ghost town.\nOur apartment building is on the hudson river. The Gotham Gal has a photo of what happened to it on Monday night on her blog . Our basement filled to the brim with part of the Hudson River and possibly a bit of the Atlantic Ocean as well. Happily we've been able to pump all of that water out as of last night. Every building on our street was pumping water out into the street the past two days. The Far West Village is a mess and will be for a while more.\nWe will be in remediation and repair mode for a while. We don't know how long yet. So we've been focusing on finding a place to live in for the next month or two. We are committed to getting back downtown as soon as power comes back on. All signs indicate that will happen in the next day or two.\nIn the meantime, we've been staying with friends on the upper west side. They have not one, but two families, camped out with them for the past few days. We are very fortunate to have such good friends.\nWhat comes to my mind most as we struggle through all of this is how others who don't have the resources we have are dealing with things. I have to believe that tens of thousands of NY'ers are homeless or seriously displaced by the hurricane. And I am equally sure that many of them don't have the wherewithal that we have to deal with it. Those are the people that need help in NYC right now, not us.\nI would guess this goes without saying, but I am not working this week. I am trying to stay up on my emails and doing a few calls here and there on urgent matters. But if you don't hear from me this week, don't be surprised. My attention is largely elsewhere.", "title": "Status Update"}, {"body": "On the heels of its paperback release, I would like to recommend a book that is required reading in our shop, Internet Architecture and Innovation by Barbara van van Schewick . I've mentioned Barbara before on this blog . She is a Law School Professor at Stanford and has written extensively on this important topic.\nI am a fervent believer that everything that is great about the Internet emanates from its underlying architecture. That's where Barbara is coming from too, which is probably why we like her and her work so much at USV.\nIn this book, Barbara argues that the massive amount of innovation that has been made on top of the Internet is directly applicable to its architecture and that there are some parts of the architecture, most notably the last mile in wired and mobile, that are problematic and that do not benefit from the hypercompetitive nature of the open Internet.\nThis is an important piece of policy work and anyone who cares about the Internet ought to give it a read.", "title": "Book Recommendation: Internet Architecture and Innovation"}, {"body": "I ended yesterday's post with this:\nHurricane Sandy looks to be coming through NYC at that time and I don't know what that may cause me and my family to be doing at that time. We live right on the Hudson, at the border of Zone A. So I've got a few things on my mind today that fit right into this Sustainability theme....\nStay safe everyone on the east coast today. Let's hope the hype is overblown. And let's prepare as if it isn't.\nOn my way back from a business breakfast, I saw folks in Hudson River Park looking at the Hudson River so I walked over and recorded this video of the Hudson breaching its banks around 10am eastern.\nThat was the moment I knew that our street would turn into a lake. I just felt it in my gut. Around that time my partner Albert posted this on his tumblr. We traded a few comments and he led me to this page on NOAA's website. This was the chart I was tracking all day yesterday:\nAt the time I took that video the water height on this chart was around eight feet. You can see that it peaked at about 14.5 feet. That's 6.5 feet higher than the time of my video.\nAfter our monday team meeting (which we did on Google Hangouts with great success), I went downstairs and explained to the Gotham Gal and Josh that we should evacuate. I got a little pushback from both but mostly from Josh who thought we could ride out the storm in our apartment.\nI was adamant that we should leave. I told them that our street was going to become a lake (or worse a river) and that we would lose power and things would be a mess. I finally won them over and we headed out around 4pm. We went uptown to stay at a friend's house on higher ground. Before we left, the Gotham Gal and I went to the basement storage room and removed all family heirlooms and anything we couldn't replace easily and took them upstairs to our apartment. But we forgot to empty the ice makers in our apartment (which caused me to wake up in the middle of the night last night with an \"oh shit\" moment).\nWe spent the rest of the day following events on Twitter and TV. The Mayor's regular updates on TV were helpful, but by far the best coverage of Sandy was on Twitter, with links out to blogs and Instagram. That led me to tweet this out yesterday night.\nTwitter owns times like this. Images, important news, quotes, videos, and lots of humor #sandy\n-  Fred Wilson (@fredwilson) October 29, 2012\nOur street in the west village did in fact become a lake with somewhere around 5 feet of water at the height of the storm surge. Our building's basement was submerged and our ground floor apartment which houses the Gotham Gal's office took many feet of water. The building lost power and I suspect it won't have it back for a while. It was a disaster from which we will be impacted for months I suspect.\nBut as bad as our street and building had it, much of NYC had it worse. Lower Manhattan and parts of Brooklyn were flooded way worse than the west village. The subway system took the most severe  flooding of anytime in its history. Many of the subway tunnels between Manhattan and Bronx, Queens, and Brooklyn are flooded. And some of the automobile tunnels are flooded too. There have been power plant explosions, fires, and all sorts of other Sandy related calamaties.\nIt was a big storm and it wreaked much damage on NYC last night. But the loss of life was relatively low and from what I can tell, city officials and the first responders in the fire and police department did their usual heroic job. We will get through this the same way we have gotten through other disasters.\nI may take the week off. I have a lot to tend to on the home front and NYC is not going to be the easiest place to live and work this week. My son's school is almost certainly closed for the next few days.\nBut I'll likely keep blogging. It helps to be able to talk about this stuff, to get it out, and to discuss it. So we can start doing that while my family and I start digging out.", "title": "Reflections on Sandy"}, {"body": "I've enjoyed teaching the Skillshare class on Sustainability . I've learned a few things about the hybrid class model and I have shared them with the Skillshare folks. It's tantalizing to think about the power of teaching a class to 2,731 people at one time. But when I compare that to the power of teaching 75 people in person , the hybrid model shows it's weaknesses.\nI need the real-time feedback from the students in the class. I need to see if folks are getting what I am saying or if eyes are glazing over. I need to know if I need to take another tack on the material before moving on. And I don't get that with a massively open online approach.\nSo my next class is going to combine the in person dynamic with the power of a massively online approach. The best thing to come from the hybrid class model is the idea of using google hangouts/youtube to broadcast the class to everyone. I am going to do that from now on.\nI also like the idea of teaching a four part class with a blog post each week. I can build on that model too.\nI am less happy with the discussions on Skillshare and that they did not tie into the discussions that happened on AVC. I need to figure out how to make all of that work better. It's obvious that a teacher (me) can't give real time feedback to 2,731 students. And I think leveraging the students to give feedback to each other (the disqus model), is right. So it's worth working on this model to perfect it.\nI want to thank Michael from Skillshare for prompting me to write about Sustainability this month. As I said in my first blog post on the topic , I think Sustainability is a great model for business owners and leaders to take in thinking about the highest objectives of the company. If I have contributed anything to the way business leaders think about Sustainability, then I have accomplished my goals with this class.\nI am going to postpone my final office hours which were scheduled for this evening at 6pm eastern time. Hurricane Sandy looks to be coming through NYC at that time and I don't know what that may cause me and my family to be doing at that time. We live right on the Hudson, at the border of Zone A. So I've got a few things on my mind today that fit right into this Sustainability theme. I will report back on a new date and time for my final office hours.\nStay safe everyone on the east coast today. Let's hope the hype is overblown. And prepare as if it isn't.", "title": "MBA Mondays: Sustainably Class Wrapup"}, {"body": "The startup school talks are great. I've watched a bunch of them.\nJoel Spolsky is the founder and CEO of our portfolio company Stack Exchange .\nHis talk is a great discussion of the difference between the \"get big fast\" strategy and the \"organic growth\" strategy. This is something every entrepreneur really needs to understand. We see a lot of folks pitching us to invest in \"organic gowth\" businesses and Joel explains why that is a mistake.\nHere is his talk  (sorry I can't for the life of me figure out how to embed the startup school talks).", "title": "Video Of The Week: Joel Spolsky at Startup School"}, {"body": "I tried out a new service this past week called Gmail Meter. It's a free analytics service that tells you stuff about how you use Gmail. It is brought to market by the folks at ShuttleCloud, which does archive and data migration for cloud services. It's a way for them to get to know folks who might become ShuttleCloud customers in the future.\nI learned a few things. I get 6,470 legit emails a month from 1293 different senders. I send/reply to 2,676 emails to 777 people. So the send/receive ratio across my inbox is 41% which is higher than I thought. I feel a tad better. But there are also at least 516 people who sent me an email last month that did not hear back from me. That makes me feel a bit worse.\nThe single highest send/reply ratio in my world is the Gotham Gal who sent me 133 emails of which I replied to 100, for a 75% return rate. I've got work to to do there. Sorry Jo. My partners Albert, Andy, Brad, and John get between a 50% and 70% reply rate. Sorry USV folks. The one cohort that I send more mail to than I get replies from is my three kids. I get a worse response rate from them than all of you get from me. Not sure how I feel about that.\nThis chart will not surprise anyone here at AVC but it does show that the one time I reply to more email than I get is the 5am to 7am time frame.\nHere are a few more interesting charts:\nThe first chart shows that I get to most of my email within 24 hours but there is certainly a meaningful percentage that takes longer.\nThe second chart shows that I send a ton of short emails. 80% of my email is less than 30 words. Whereas greater than 50% of the emails I get are longer than 100 words.\nI've asked the Gmail Meter folks to add a chart showing reply ratio on emails less than 30 words versus emails greater than 100 words. When I get that chart I will publish it here because I think that is single best secret to getting a reply from me.\nAnyway, I found this data valuable. Maybe you will to. You can try it out at Gmail Meter.", "title": "Gmail Meter"}, {"body": "This fun friday topic was suggested by a community member in the comments sometime in the past week. I like the idea so today we will all share good Twitter follows with each other.\nI'll share a few of the best twitterers I know of with all of you and then you can take it from there.\nSports: Bill Simmons\nPolitics: John Heilemann\nTech: Anil Dash\nFinance (& Comedy): Howard Lindzon\nFashion/Culture: Alexa Chung\nMusic: Bob Lefsetz\nWhen you share twitter handles in the comments section, please link to them so the follow is easy on everyone. Thanks.", "title": "Fun Friday: Who To Follow On Twitter"}, {"body": "A few weeks ago Gillian, who keeps me on schedule and a lot more, said to me, \"there's a day coming up when you are going to do four appearances in one day.\" I thought to myself that was a bit much but didn't do anything about it.\nYesterday was that day. I gave talks at Baruch College, Google Hangouts/YouTube, Skyped into an entrepreneurs meetup in Milan Italy, and ended the day talking to the Kauffman Fellows Program at the Alexandria Center in NYC.\nThe thing I learned yesterday is that sitting at my desk and talking to folks around the world, via the power of Google Hangouts and Skype, is an amazing thing. Of course I've been using these tools for a long time. But yesterday was still a bit of a wakeup call for me.\nThe Google Hangouts/YouTube thing was a MOOC called Entrepreneurship in Education that is being taught by David Wiley, Todd Manwaring, and Richard Culatta. It was an hour long back and forth on the issues around entrepreneurship in online education. Here's the video of the conversation.\nThe really awesome part of this class is the way that Google Hangouts allows you to have a small interactive group talking about things that is then broadcast to a much larger group. I am going to try to replicate that in my final Office Hours next monday in my Skillshare class.\nThe Skype into the meetup in Milan was equally awesome. I don't have the video of that to share but here's a twitpic that I saw on Twitter after my talk that gives you a sense of how the folks in Milan experienced it:\nAs much as I enjoyed the talks I gave at Baruch and the Kauffman event, it was the talks that were delivered online that excite me more. Because online video allows me to talk to folks around the world. And I think that takes the conversations I want to have to a much broader audience and hopefully helps people all around the world think differently and ultimately act differently in the ways they think about bringing their ideas to market.", "title": "Four \"Appearances\" In One Day"}, {"body": "I've got a ton going on but nothing to say about it today. So instead of a daily post, I am going to share a video with you that has been suggested to me by a few of you in the community and a bunch more over email this past week.\nIt's Seth Godin talking about education and what we need to do about it. I watched it this morning and hopefully you can too. It's 16 minutes long.", "title": "Seth Godin On Education"}, {"body": "Possibly the biggest local policy issue in NYC for tech companies is the lack of good broadband infrastructure in the city. We could get into a debate about broadband policy at the local and national level, but this post isn't going to be about that. This post is about something City Hall is doing about the broadband issue.\nIn the spirit of \"race to the top\" and other contest based efforts to attack stubborn problems, NYC has launched the ConnectNYC Fiber Challenge in partnership with Time Warner Cable and Optimum Online (Cablevision) to provide fiber build out to businesses.\nHere's how it works. You sign up at ConnectNYC, you get and sumbit a letter from your landlord saying they will allow fiber installation in your building, and then you describe how high speed broadband will positively impact your business.\nThe judges will select the winners and NYC EDC, Time Warner, and Optimum will invest $12mm over two years, with $7mm being invested in year one, into fiber buildouts for the winners. It is estimated that each installation will have a value of $50,000 of investment by Time Warner and Optimum.\nIn addition to getting a lot of local businesses high speed broadband, this contest will also give an indication to the city and local ISPs of where the most important neighborhoods are for broadband buildout.\nWe spend a lot of time with our portfolio companies dealing with infrastructure issues around real estate and broadband and I can tell you that this is big problem in NYC. Companies that want to move to low cost neighborhoods with interesting buildings like Red Hook, Gowanus, Vinegar Hill, the Greenpoint waterfront, Long Island City, and other similar places simply cannot do that due to the lack of good broadband. If the city wants to see these neighborhoods emerge commercially, they will need to deal wtih the broadband problem. ConnectNYC is a nice way to get going on the problem. If you are struggling to get a fiber installation in your building, give ConnectNYC a try.", "title": "The ConnectNYC Fiber Challenge"}, {"body": "This is my final post for my Skillshare class on Sustainability.\nI will not do office hours this evening but I will do one final office hours next Monday, Oct 29th, from 6pm to 6:30pm. The link to attend that office hours is here.\nFor this final post, I want to focus on the Business Model Canvas and how to think about sustainability in the context of creating your business model. In order to talk about that, I went ahead and created a Business Model Canvas of my own using bmfiddle.com.\nMy Business Model Canvas is for a Bitcoin Bank.\nIf you think about banks in the real world, they are high cost affairs, with huge fixed costs including large branch networks. I am always shocked by how many bank branches I pass in a five to six block walk in NYC. The way these banks sustain these high costs is with large fees for depositors and high spreads between their cost of funds and the interest rates they charge borrowers.\nSo in thinking about how to create a sustainable Bitcoin Bank, I focused on a few key things:\n1) keep the operating costs super low except in areas where there is a unique and important consumer value proposition\n2) make it easy to access the bank and your balances within the context of low operating costs\n3) keep the fees charged to customers as low as possible\n4) allow third parties to build busineses on top of our business\nThe result is a super simple business model. My Bitcoin Bank would charge a very low monthly fee per Bitcoin deposited and nothing else other than pass alongs for any costs incurred in moving bitcoins in and out of the bank on behalf of our customers. We would not have any branches. We would operate via simple, easy to use mobile and web interfaces. We would keep our operating costs super low with the exception of one area where we would make a large and ongoing investment - in hiring and retaining a top notch and super experienced security team. We would allow third parties to create related businesses on top of our API. Services like lending, investing, etc would not be provided by our bank but by third parties who access our customers via our API.\nI believe this business would be highly sustainable because it would focus on one very simple value proposition - security. And in return it would charge the lowest fees possible in order to make and sustain a profit. It would make it very difficult for others to price lower fees for storage and security. And it would benefit from the ecosystem of third party value added service providers operating on top of its API.\nHere are some decisions I made in order to increase the sustainability of the business:\n1) A focus on very low fees to our customers so that it will be difficult for competitors to undercut our offering.\n2) A decision to focus on only one thing, security, and allow others to build additional services for our customers. This allows us to be best in class at the one thing we choose to do and it means our customers can choose to pay for additional services or not, and always on their own terms.\n3) A cost model that keeps operating costs as low as possible in all areas other than security, which is our key consumer value proposition.\nSo when you are finalizing your Business Model Canvas for your final project for this course, think about what your key value proposition is and who is your primary customer and focus on that. And think about what you can do in your revenue model to make it so that it will be hard for others to come in and undercut you. And think about your cost model and how to keep it as low as possible while allowing your company to be best in class at what it does.\nPlease submit your final Business Model Canvas project here by Thursday, Oct 25th, 11pm EDT. I will pick out a bunch that I like and review them next week on office hours.\nThat will be the final event in this course. I hope you have enjoyed this class/series. I think sustainability is an important and overlooked aspect of business and it needs to built more tightly into business thinking.", "title": "How To Be In Business Forever: Week Four"}, {"body": "The NY Times has a good post up today about Mike Bloomberg and his new Independence USA PAC. Frequent readers of this blog know that I am a big fan of Mike Bloomberg and his politics. I do not think there is a major issue before this country that I don't agree with him on. There is nothing more that I would wish for than a centrist like him in the White House.\nIn the post, the Mayor has tough words for both Obama and Romney, as he should. But one wonders whether both men are hostage to their party orthodoxy and therefore can't and won't speak honestly and candidly the way the Mayor can and does.\nMaybe the millions that the Mayor will dole out this year and in coming years will help give elected officials the courage to do what is right instead of what is expected of them. I am not optimistic, but I am hopeful.", "title": "The Far Center PAC"}, {"body": "The video of the week this week is from Popular Science and it comes from the ribbon cutting ceremony for our portfolio company Shapeways' Factory Of The Future in Long Island City. Notice that the Mayor cut the ribbon with 3D printed scissors. You can read more about the scissors here.\nThe video of the week this week is from Popular Science and it comes from the ribbon cutting ceremony for our portfolio company Shapeways' Factory Of The Future in Long Island City. Notice that the Mayor cut the ribbon with...", "title": "Video Of The Week"}, {"body": "I was at a USV event last week in SF and I bumped into Sung Hu Kim, a product manager at Twitter who handles mobile stuff. We got to talking about things I'd love the Twitter Android product to do. I mentioned that my daugther tweets a fair bit but I often miss them because I follow 735 people, many of them prolific tweeters. I do have a family list but I only get around to checking it every few days and I often miss opportunities to @reply to Emily.\nSung pointed me to the mobile notifications settings and we turned on notifications for Emily on my Android. Game changer! Now I get a notification every time she tweets and I can immediately favorite it, retweet it, or reply to it. I turned on notifications for about ten others including of course my wife.\nHere's how to you do it (I assume this works on Twitter for iPhone too but I don't know for sure).\n1) Navigate to someone's profile. You can do that by clicking on their avatar in a tweet. Here is my friend Bijan's profile on my phone.\n2) Do you see that little image of a head under the block that says \"tweets\" on the middle left? You click that. And you get this dialog box.\nClick on \"turn on notifications\". That's all you have to do.\n3) Then you get notifications at the top of your home screen whenever someone you've added to mobile notifications tweets. Those notifications look like this (look at the very top of the home screen):\nFor those that are curious, that is Gilligan on my home screen. My friend Josh Harris painted that Gilligan and the original hangs in my office at USV. The Gotham Gal also has a Gilligan in her office. For those that know Josh and his obsessions, it has great meaning. It represents the crazy web 1.0 era in NYC in my mind. It is one of my favorite art pieces we own.\n4) When you pull down the notifications tray on Android, you actually can see part of the tweet. And you can click on it to go to the tweet. Here's a notification of a tweet from Bijan (who I've added to my mobile notifications as well).\nI have had this feature active on my phone for the past week and it has significantly increased my usage of twitter as I am now seeing in real time the tweets from the folks I care most about. I love it.", "title": "Feature Friday: Twitter Mobile Notifications on Android"}, {"body": "Engine Advocacy and NY Tech Meetup are hosting a conversation next Thursday, Oct 25th, from 6pm to 7:30pm, at the NYU Stern School about The Open Internet and the 2012 Election .\nThey've asked me to participate in this converssation along with Clay Shirky and Susan Crawford. Clay should not be a new name to this community. But if you don't know who Clay is, you can read about him here . Susan was President Obama's Special Assistant for Science, Technology, and Innovation Policy for the early part of his first term. You can read more about her here .\nTickets are $10/person and the event is roughly half sold as of 6:45am today. If you want to attend you can get a ticket here .\nI am big fans of Clay and Susan, and equally thrilled to support Engine Advocacy and NY Tech Meetup. So I'm looking forward to this event. And of course the topic is timely and important. I hope to see you there next Thursday.", "title": "The Open Internet and the 2012 Election"}, {"body": "It's pretty common practice these days to pull out a tablet or phone during big live events and watch on two screens. The industry has taken to calling this the second screen experience. Or social TV. It's an area our firm has a few bets in, most notably Twitter and GetGlue.\nBut last night during the debate, I found myself in need of more screens. I could have used something like this:\nattribution link\nI had the #debates feed on my personal Nexus 7. I had John Heilemann's twitter feed on my phone. I had Tumblr going on my laptop. And I had CNN on the family room Nexus 7. And I was actually watching the debate first and foremost.\nThe big surprise was how active Tumblr was. The memes were coming fast and furious during the debate. The binders full of women meme was active within minutes of that line emerging from Mitt's mouth. The debate tag was also a great one to follow on Tumblr last night.\nBased on the tweets I was seeing flying by on Twitter last night, I am certain that I'm not the only one who watched the debates this way. Actually I am pretty certain that this is becoming more normal by the day.\nIt all makes me wonder if the current crop of social TV apps are missing a big aggregation opportunity. I suspect lots of good stuff was going on elsewhere last night (Facebook, Pinterest, Canvas, etc), but I just didn't have enough screens in my family room to be everywhere at the same time. Maybe we need an app for that.", "title": "Second Screen, Third Screen, ..."}, {"body": "Our portfolio company Boxee announced their next generation device today called Boxee TV.\nBoxee has always been about making it as easy as possible to watch TV over the Internet and Boxee TV represents years of listening to customers wants, needs, and desires. The result is a trifecta of Internet TV goodness:\n1) Free Broadcast Channels in HD\n2) No Limits DVR - record as much as you want and watch wherever you want\n3) Internet apps like Netflix, Vudu, YouTube & Vimeo\nAvner's post on Boxee TV has more details.\nBoxee TV will cost $99 and will be available in early November. Sign up to get an email when it launches.", "title": "Boxee TV"}, {"body": "It is week three of my Skillshare class on Sustainability in Business.\nI will be doing office hours today at 6pm eastern. You can watch them here on this link. If you want to submit questions for office hours, you can do that here. Just like last week, I will review a few business model canvas projects and then will answer questions for the rest of the office hours.\nThis week I'd like to talk about company culture and how it impacts sustainability. If you want to be in business forever, you need to build a culture that sustains the business. I talked a lot about this in a post on culture a while back. You should give that a read as part of the assigned reading for this course. Here is the money quote from that post:\nCompanies are not people. But they are comprised of people. And the people side of the business is harder and way more complicated than building a product is. You have to start with culture, values, and a committment to creating a fantastic workplace. You can't fake these things. They have to come from the top. They are not bullshit. They are everything. There will be things that happen in the course of building a business that will challenge the belief in the leadership and the future of the company. If everyone is a mercenary and there is no shared culture and values, the team will blow apart. But if there is a meaningful culture that the entire team buys into, the team will stick together, double down, and get through those challenging situations.\nI bumped into a friend last week who works at a company that is going through a difficult time right now. I asked him about the \"talent drain\" that is going on in his company. He said \"the ones who were in it for only the money are long gone, the doubters are gone now too, and we are left with the true believers now.\"\nI thought to myself that the mistake the CEO of that company made was bringing the mercenaries and doubters into the company in the first place and allowing them to stay.\nMercenaries have no place in your company and your culture. Doubters are a bit different. You certainly don't want to create a culture of \"yes maam\" in your company. So some doubting is healthy. But it should be out in the open. The doubts should be expressed upfront and they should be discussed and debated. But once the decisions have been made, everyone needs to get behind them. Ongoing doubting is not helpful to a culture.\nTrue believers are required to get through the hard parts. And you need to be the leader who inspires the true believers. Watch this short video where @dens described what he did when Facebook launched a competing product to Foursquare.\nYou get true believers in your company by giving them something to believe in and someone to believe in. That is you. Even if you are scared shitless or bummed out, you can't show that to the team. You have to lead if you want the team to follow.\nThe thing that you give them to believe in is called a vision. Make it a long one, a very long one. I like Bill Gates' vision for Microsoft:\nWhen Paul Allen and I started Microsoft over 30 years ago, we had big dreams about software,\" recalls Gates. \"We had dreams about the impact it could have. We talked about a computer on every desk and in every home.\nA computer on every desk and in every home. That was a big hairy audacious goal in the late 70s. And it is exactly what happened, at least in the developed world.\nThe cool thing about that vision is it is drop dead simple to understand but took decades to execute. That's a long vision that your team can buy into and stick with for the long haul. That's what you need.\nSo if you want to build a business that lasts, you need a big and long vision and you need to be a leader who can inspire the team to believe in the vision and to believe in you. You need to hire folks who will stick around for the long haul and you need to be open to the doubts and doubters. But if they keep doubting, you need to part company with them. Don't hire mercanaries. They won't work no matter how hard you try.\nBuilding a culture that can sustain the business is the most important investment you can make in your company. Once you've gotten a product into the market and proven product market fit, there is nothing that is more important than team, culture, and values. It is the glue that holds the whole thing together for the long haul.", "title": "How To Be In Business Forever: Week Three"}, {"body": "Alexis Madrigal has an interesting post up on The Atlantic about \"dark social\" vs \"public social\". Alexis makes the point that private sharing via email, IM, and other means drives more traffic around the web than public social services like Twitter, Tumblr, Facebook, Pinterest, etc.\nAlexis makes the broader point in the piece that the Internet has always been social and that the emergence of these newer social platforms is overblown. I agree with Alexis that \"dark social\" is a very powerful driver of traffic, but I think Alexis is missing a big point about the power of public sharing.\nPublic sharing opens up the share to all sorts of interesting engagement that is just not possible in \"dark social\" systems.\nI will give an example of something that happened yesterday to make my point. I went a walk on the High Line yesterday afternoon. As I was headed north at the 10th Avenue Ampitheater, I came across this huge billboard art installation:\nI was smitten with this piece and spent five or ten minutes taking it in. Then I snapped a few photos of it on my phone and posted them to Instagram, Foursquare, and Tumblr. I was curious about the artist and the piece but didn't really do anything to figure out who had created it.\nThis morning as I was looking through Tumblr, I saw that my post of the art installation on Tumblr had gotten quite a few reactions, including this reblog from Kevin Slavin. Here's what Kevin had to say about it:\nI'm so excited to see this wash up in Fred's feed and to see others responding to it.\nIt's not labeled anywhere and there's no obvious way to know, but this is an old piece by one of my two great early mentors: Thomas Bayrle.\nLooking back, I realize I've blogged about him frequently in the last few years including Five films, Documenta, an old piece I helped him with, a quick reference in a post by Greg, and his inspiration in an old essay for Brockman.\nThere are so many things to know that give this piece additional gravity. To know, for example, that this was made by hand, back in the 70s, no computers, and that the distortion of the logo was done by stretching latex with pins and tracing it.\nTo know that Thomas was a textile designer before he was a full-time artist. To understand the direct connections between Thomas, Peter Roehr and yes, Andy Warhol, who had similar predilections and procedural approaches to repetition, all at the exact same time.\nTwenty years ago exactly, I was an artist working in Thomas' studio in Frankfurt, and it's no exaggeration to say that he taught me how to see. Like any great artist, Thomas is an astronaut, and he's brought back images of places we might someday get to.\nThat this car has arrived some 40 years after he made it... well, that's because we're slow. No matter how fast the network gets, no matter how fast the market moves, they'll never catch up to artists who have all their sensors in play.\nHow awesome is that? Now we know who the artist is - Thomas Bayrle. And we know when he made this work, we know how he did it, and we know that Kevin studied with him.\nPublic sharing of social media made all of that happen. Sharing a picture of the art installation with my wife and/or kids via gmail, sms, kik, or some other form of private sharing could not have and would not have produced this information. And even if it had, it would not have produced it publicly.\nSo say what you will about \"dark social\" and private sharing. I'll take brightly lit public social any day.", "title": "Public Sharing vs Private Sharing"}, {"body": "I took two flights across the country this week so in addition to a lot of catching up on email, I read a book. It is called Makers and it was written by Wired editor in chief Chris Anderson. This is the third book that I've read by Chris. The previous ones were The Long Tail and Free.\nChris writes books about the same things I blog about and USV invests in. We are certainly in sync in terms of the themes and memes that we are paying attention to.\nAnyway, Makers is about \"the new industrial revolution\" that is brought about by personal manufacturing devices and web scale creation and innovation. It's about the intersection of companies like Etsy, Kickstarter, and Shapeways (all USV portfolio companies).\nI suspect that there is nothing totally new to all of you in Chris' book. But he frames what is going on very well and I find these frameworks provided by folks like Chris and Steven Johnson and others to be incredibly helpful as we deal with a firehose of information and investments and try to find signal through the noise.\nIf you are interested in the revolution happening in personal manufacturing and are curious about what it means for innovation, startups, and even the economy and society, pick up a copy or put it on your Kindle. It's a quick read and a good read.", "title": "Book Review: Makers By Chris Anderson"}, {"body": "At the tail end of yesterday's blog post was this set of related posts:\nA few folks asked me what was generating that set of links so I figured I would blog about it today.\nI have used Zemanta's recommended links service on my blog for something like four or five years now. It works like a spell checker. As I write the post, Zemanta understands what I am writing about and recommends in text links (hyperlinks), related images to add to the post, and related links at the end of the post.\nAfter using Zemanta for a while, USV became an investor and I joined the board in the summer of 2008. The company has grown a lot in the past four years and has turned into a nice business serving the content marketing community.\nSometime this summer, Zemanta added the ability to use thumbnails in the related links at the bottom of the post. I recently turned the feature on and that's why you are seeing these thumbnails from time to time at the end of the post.\nIf have a blog and want to use Zemanta, you can sign up here.\nIf you are wondering why linking out is a good thing, watch this video:", "title": "Feature Friday: Zemanta Thumbnails"}, {"body": "When I come to SF, I generally don't rent a car. I've used cabs and more recently Uber to get around. But many times I just walk from meeting to meeting around SOMA where most of the tech companies are.\nThis week I tried something different. The Gotham Gal is a seed investor in a company called Scoot Networks who has launched a service that is best described as \"zipcar for scooters.\" My colleague Nick and I rented scooters yesterday and used them to get back and forth to our meetings. I have my scooter until tonight when I am going to return it.\nHere's a photo of me on a Scoot:\nThe scooter is electric and very light. It is only 50 cc. It has enough speed and acceleration to get around SOMA easily. It is not as powerful as the 150 cc Vespa I ride around NYC, but I was totally comfortable on it and it worked great for me yesterday.\nYour phone is your \"key\". You join Scoot Networks and use their web app (native apps are coming). You place your phone in a bracket on the handlebar and connect an iPhone or USB connector and that turns the bike on and off.\nThen you can drive around from meeting to meeting, parking the bike on the street.\nScoot Networks is currently only operating in San Francisco, but they are planning a larger rollout in the future once they get San Francisco working well. If you like to ride a scooter and travel to SF frequently, I suggest you give it a try. I am really enjoying it.", "title": "Scoot Networks - A New Way To Get Around SF"}, {"body": "As we have blogged about, we are working internally to update our web presence. We've hired a part time software engineer who is helping us build something that we hope will better leverage the network that exists inside and outside of our firm, portfolio, and relationships.\nAs part of that work, we have decided that our identity could use a refresh too. So we've partnered with our portfolio company Behance and are conducting an online talent audition to design our new identity.\nHere's how this design competition works:\nTo participate, simply submit your best brand/identity design work from your portfolio for consideration by our panel of judges (Note: this is NOT a \"spec contest,\" just submit a past project that best exemplifies your brand/identity work). The top 5 projects will be deemed \"winners,\" and their owners will be invited to take on USV as a client, proposing a new identity for USV, with a $1,500 guaranteed payment for responding to the brief. If your initial proposal is selected, USV will provide an additional payment of $12,500 for the completed work.\nIf you are interested, please visit the Behance page and click on the big green \"submit your project\" button. If you know someone who might be interested, please send them the link and ask them to submit their project for consideration.\nMy partner Albert, who is on the Behance board, has a longer post on the USV blog explaining why we are doing this and why we partnered with Behance to run this competition.", "title": "USV Identity Talent Audition"}, {"body": "I get behind on email a lot. I am right now actually.\nAt times like this, I often want to use gmail hacks to make sure I am seeing the most important email. I have some that showcase the messages from my most important contacts (my wife, my kids, ...).\nBut another super important cohort of email messages are the replies to the emails I have sent in the past few days (or up to a week).\nI'm wondering if anyone has a good hack that will reveal only those messages in the inbox. I'd be super appreciative.", "title": "Help Wanted: A Gmail Hack To See Only Replies To My Sent Messages"}, {"body": "First we'll take care of some logistics and then we'll get to the post of the week in my Skillshare Class on sustainability in business.\nOffice hours will take place at 6pm eastern today. The link to the hangout is here. I don't like the way office hours worked last week and so I am changing them up. I will start by asking people to post questions in the discussions tab in the skillshare class page. Then I will review a few business model canvas projects live for everyone to see. Then I'll finish up the 30 minute session by answering as many questions as possible while time lasts.\nThere are roughly 80 business model canvas projects posted so far. You can see them here. Since I will only be able to review a few of them today in office hours, it would be great for anyone who is taking this class to stop by and pick a few to give comments on.\nIf you are looking for a web-based tool to build and share your business model canvas, this thread mentions several of them.\nOK. Now that we are done with the logistics, I will move on to my second post in this series.\nLast week we talked about long term thinking vs short term thinking. But sometimes, no matter how long term you are thinking, things happen that you didn't plan for and they can impact your business. Actually, this always happens. And that is when you need to adapt.\nYou will not stay in business forever if you don't adapt to changing market conditions. This doesn't mean adopting the \"business model of the hour\" model and this doesn't mean pivoting either. What I am talking about is the once every few years \"oh shit moment\" when you realize that the path you are on isn't going to work in a year or two and that you need to make some changes.\nThis is a frustrating realization. I have a good friend who has been running a business for more than a decade. He told me a few weeks ago that he thinks the market he has been operating in is changing and it is starting to impact his business. And just when he had everything firing on all cylinders.\nThat's how it is in business. Just as you are taking the victory lap for the kickass execution you and the team have delivered, the track takes a tilt and things start getting harder. Businesses don't operate in a vacuum. They operate in a dynamic ever changing market that is going to make things difficult for you, especially if you want to be in business forever.\nI think some examples will help. The one that comes to mind front and center is Microsoft. By the middle of the 1990s, Microsoft had it all. They had a dominant share in desktop operating systems and a dominant share in desktop apps. They were literally printing money. Then the commerical internet happened. Netscape showed up. And Microsoft's market changed, forever.\nMicrosoft did adapt. They built Internet Explorer in reaction to Netscape and then used their desktop dominance to push it into the market, hurting Netscape so badly that it had to sell to AOL. That got Microsoft into trouble with the Justice Department and they were investigated as a result.\nBut what Microsoft didn't see in 1995 was Google because it didn't exist. And they didn't see the emergence of cloud based productivity apps because they didn't exist. In hindsight, it is pretty easy to see how fundamentally transformed Microsoft's business has been by the Internet and it is also pretty easy to see that they have not been able to adapt sufficiently to maintain any semblance of the dominance they had in the mid 90s. This stock chart tells you everything you need to know about what the Internet did to Microsoft. They may be surviving but they are certainly not thriving.\nAnother great example is RIM. I don't even need to tell this story. Everyone knows that the dismissive tone and stance that RIM's management took toward the iPhone and what it represented was essentially the death knell of a great company. I suspect they wish their stock chart looked like Microsoft's.\nBut let's look at a more positive example. As Ron Ashkenas points out in this HBR article, IBM saw that the hardware market was changing and their competitive position in it was changing with it. They sold their PC hardware business in 2005 to Lenovo and doubled down on consulting and related services. Their stock chart tells the rest of this story.\nAdapting doesn't always mean exiting a business that you decide has issues. You can also retool, reshape, and refocus the business. A company that I've worked with for more than a decade saw the industry it services go through some painful transitions in the 2008/2009 downturn. They built an entirely new line of products that service the growth part of the industry while working to maintain the older products through an orderly and gradual decline. It's been a difficult transition because it has meant that the company's top line hasn't grown during this transition. But the company is still in business and the new products are growing quite nicely.\nEvery situation is different and I don't have some \"silver bullet\" to help you all think about how to figure out when to adapt and when to stay the course. But I do have some observations. The comfort of a strong balance sheet (and a nice looking stock chart) is often your enemy not your friend in these situations. The most agressive CEOs I've seen in these situations are often the ones with less than a year of cash in the bank and survival instinct in full on mode.\nAnother observation is that getting your organization to adapt is harder than you might think. Organizations have inertia. The bigger they are the more inertia they have. If you think you need to adapt your business quickly, you will need to figure who is in the boat with you and who is not and make the changes you need, particularly on your senior team, to align the team with mission and get going.\nFinally, you cannot be in adaptation mode all the time. If you map out long living successful businesses, you will see they go through periods of great stability followed by periods of great change and then move back into stability mode. You have to know when to get into which mode and you need to see each one through to its logical conclusion.\nGiven how hard all of this is, you might wonder if you really want to stay in business forever. The answer may be no. But even if it is no, you had better plan for and act like you do. Because I am certain that if you don't, you won't.", "title": "How To Be In Business Forever: Week Two"}, {"body": "I read most everything written online about the sectors and the companies we invest in. I know the truth about many of these stories. And I am constantly shocked about how wrong the media gets it. I am not going to call out any specific journalist or story but I would simply advise folks to take everything they read with a big grain of salt.\nI would be particularly cautious when the subject of the story does not make themselves available for the journalist. The journalist can get pissed and take swipes .\nIt's important to stay abreast of what's going on. I am not saying don't read the stories. I am simply saying that you should not take them as gospel. Treat them for what they are; a mix of facts, gossip, and fantasy. The fantasy quotient is particularly high these days, for some reason.\nAnd the publication standing behind the journalist doesn't seem to matter a bit. Techcrunch can be really good, and it can be really bad. The NY Times can be really good, and it can be really bad. I have read pure fantasy in both.\nI often wish I could write the truth. But the truth is often told to me in strict confidence. So I can't and won't. The media's job is to find out the truth and print it. I am glad we have a media in society whose job is to do this. I'm just shocked at how often the truth is missing and fantasy is told in its place.", "title": "Don't Believe Everything You Read"}, {"body": "In a comment thread last week Raju said:\nFred\nI would like this community involved by sharing the best jokes they have heard in their lives or sharing the best incidents happened to their lives. Wouldn't that be great?\nBest incidents in our lives is a big one. We might go there.\nBut jokes are a lot easier. So I will give you all one and then you can share yours in the comments, as is the Fun Friday norm.\nOne ask - keep it clean (ish). Don't tell any jokes you wouldn't tell in the company of five year olds.\nHere's mine, which hopefully won't be a metaphor for this thread. It comes from the awesome and almost never clean Richard Pryor.\nI'd like to make you laugh for about ten minutes  -  though I'm gonna be on for an hour.", "title": "Fun Friday: Jokes"}, {"body": "Metainstability\nI had breakfast yesterday with a friend who had recently relocated to NYC from SF. He told me he was taken with the hyperactivity of NY'ers. I asked him where he thought it comes from. He had a great answer and I am going to share it with all of you.\nHe said that NY is \"meta unstable\" meaning that it is inherently unstable and therefore in a constant state of imploding on itself. And NY'ers implicitly understand that. So they only way we can keep the city functioning is to be constantly seeking to upgrade it in real time. So that's why the city is in a constant state of construction. That's why NY'ers are always looking for a better way to do something and a faster way to get somewhere.\nThis may sound like psycho physics babble. In fact it is. But it also captures something inherent in the NYC psychology that I have felt since the day I arrived here in 1983. This city is in a constant state of seeking to get to a better place. And that is why it is such a great place to be an entreprenuer despite all of the challenges of operating a business in NYC. And it is why I felt at home here the day I arrived and why I suspect I always will.\nI'd also like to wish a happy birthday to my partner in our Big Apple adventure. The Gotham Gal. Who brings a measure of stability to our metainstability.", "title": "NYC: Metainstability"}, {"body": "When Brad Burnham and I started USV back in 2003 and I had just started blogging, we spent a lot of time talking to potential investors in our first fund. One of their big questions we got from them about the kind of open firm we wanted to create was \"how will you be able to make money if you share all of your proprietary insights?\"\nWe really didn't have a good answer to them but our bet was that by sharing our ideas and insights broadly with the market, we would attract entrepreneurs to our firm who shared those insights and ideas. And we thought the startup community would engage with us around these insights and ideas and make us smarter in the process.\nIt was a good bet. That is exactly what happened. I think it is now best practice in VC and possibly some other investment disciplines to be broadly open with your investment ideas and insights. At least I hope it is.\nBut we are not as open as we can be and should be. We get together as a firm roughly once a month to do a \"deep dive\" on a sector that interests us. We work as team to produce a reading list and some preliminary research on that sector. And we identify a couple people who are deeply involved in that sector to come sit with us or skype with us. These sessions last roughly two hours but can often go on longer.\nChristina decided last week that we should put all of this \"research\" out there on the Internet. And of course she is right. She has posted the first set of research on usv.com today and we will continue to do this under the \"Researching ......\" headline. I think this will be really useful for us and everyone who enjoys participating in a dialog about new ideas and insights in the tech startup market.", "title": "Opening Up Our Research"}, {"body": "I saw this in a story I was reading this morning about mobile reading habits:\nA year ago, the iPad accounted for 81% of tablets in circulation. That has fallen to 52%, with Android-based tablets grabbing a 48% share of the market. Amazon's Kindle Fire accounts for far and away the largest slice of those: half of the Android tablets in use are Kindle Fires, and they represent 21% of the overall tablet market.\nIf that's true, that is a big deal. Our family has moved from iPads to Nexus 7s in our home but I didn't think the rest of the world had moved to Android tablets too.\nI am curious if others are surprised by this. I honestly had no idea that Android had made such a big move in tablets. I realize Kindle Fire is hardly Android. More like a third tablet OS. So it's really like iPad 52%, Android 27%, Kindle Fire 21%. But even so, this is a big deal and I am surprised.", "title": "A Changing Tablet Market?"}, {"body": "Its time to kick off my Skillshare class on Sustainability. I will do a post each week this month (on Mondays of course). I will do office hours on Google Hangouts on Mondays at 6pm eastern for 30 minutes all month. We will do a project together which is to create a sustainable business model canvas. And there are groups you can create or join to allow you to collaborate with each other to complete the project and the class.\nTo join today's Office Hours on Google Hangouts, please check out the Skillshare page. There will be instructions there later today.\nI will start with a post on Short Term Profit Maximization vs Long Term Business Health and then will end with some comments on our Business Model Canvas project.\nIf you want to stay in business forever, you have to focus on the long term. You must construct a business model that builds confidence and trust with your customers and keeps them coming back day after day, year after year.\nMany business schools teach executives and entrepreneurs that business is about profit maximization. I don't believe that. I believe business is about making a profit that sustains the business and enriches the owners but is not maximized in any period (month, quarter, year). I believe the goal of a business is sustainability so that all the stakeholders (customers, employees, owners, suppliers, etc) can rely on the business for the long term.\nLet's use an example. You own a business that operates on the web. You are a leading supplier of ecommerce to a vertical market. You generate $50mm in annual revenues and make a profit of $5mm a year. You see the launch of the iPhone and Android and think that your customers are going to want to connect to your business via their mobile phones. You ask your VP Product to scope out what it would take to build a comprehensive set of mobile apps that will allow this. She tells you it will take an investment of $5mm over two years to complete this project. You gulp. That is going to reduce your profits by $2.5mm a year in each of the next two years. What do you do? You make the investment because you must invest in the long term success of the business even though that is not a profit maximizing event. It may simply get you back to the $5mm per year of profits you were making before. There may be no ROI on this investment in a positive sense. It may simply be a defensive investment. You still need to make it to ensure you will be around for the long run.\nClay Christensen talks about this kind of thing all the time. Big company executives are asked to calculate an return on investment (ROI) on the investments they want to make. If the ROI isn't greater than some minimum hurdle, the company doesn't make the investment. And so along comes a smaller competitor who makes the investment and they eat the big company's lunch.\nROI is not the right framework for companies to evaluate investments. ROI is for the wall street folks. They will use it to decide if they want to invest in your company. But when you make investment decisions in your company, don't use the tools that wall street uses. Use the tools that animals use. Survival instincts. What will it take to ensure that your company is around in ten years, fifty years, 100 years? That's how to think if you want to stay in business.\nOne of the most difficult decisions entrepreneurs and executives have to make is the decision to disrupt their own business. Let's say you are a cable operator. You are making billions of dollars of profits each year providing voice, video, and data services protected by a monopoly business model. Along comes the Internet and it allows voice and video to be delivered to your customers via any IP network (wireline, cable, wireless, etc). You know that over time, this is going to disrupt your business. What do you do? Do you invest in this new technology and drive it into the market, hastening the decline of your monopoly protected business model or do you do everything you can to slow down the advance of this technology?\nSadly most executives make the latter choice. Most entrepreneurs make the former choice. The latter choice is about short term profit maximation but can, and often does, lead to the demise of the business in the long term. The latter choice is about survivability even though it will almost surely lead to a less profitable business in the future. Tough choice. But to me its an easy choice if your goal is long term survival.\nOne of the reasons entrepreneurs make these hard choices when executives don't is entrepreneurs think like owners. They have that survival instinct in their gut. They don't want their baby to die. Executives are hired guns. They are focused on maximing the success of the business (and their compensation) over a short period that they will in the corner office. They have no incentive to think about what happens in 20 years or 50 years. They know they won't be around. And so the company isn't around either.\nSo when you construct your business model and create the culture of your business, emphasize sustainability over profit maximization in everything you create and do. This does not mean that you don't need to make a profit. Profits are the essence of survivability. You can't and won't survive without profits. They are everything when it comes to sustainability. But just because you need to make a profit doesn't mean you need to maximize it. Balancing the need for a profit with the need to sustain the business is the art of what you must do as the leader of a business. Do both and you win.\nOur project in this course is to create a sustainable business model canvas. If you are not familiar with the Business Model Canvas watch this video:\nYou will either have a business or you will invent a business and then you will map out your Business Model Canvas with the goal of sustainability as you go. You can do this by yourself or in teams. It doesn't matter at all. The goal is to do this project and learn by doing.\nThe thing I want you to focus on the most is the decisions you make as you fill out the canvas and which ones you were forced to compromise on some goal in order to maximize the sustainability of the business. Those are the magic decisions and the ones we want to document and discuss as we go through this course.\nGood luck. Hopefully I will see you at 6pm eastern today in Google Hangouts.", "title": "How To Be In Business Forever: A Lesson In Sustainability"}, {"body": "I met with a friend who was in town last week. He told me he had \"hit his stride\" as an investor in the past year and a half. He is a former entrepreneur who became an angel investor and then a VC. I had a similar conversation with the Gotham Gal on a long car ride yesterday afternoon.\nIn listening to both of them, I heard something that I have found to be true in my own experience. It takes time to learn how to be an early stage investor. You have to make a bunch of investments and learn from them. And you have to develop a strategy, a thesis, and your own differentiated style which people can then attach to you. In effect you have to build a brand and become known for what you do and how you do it.\nNone of this happens overnight. I think it took my friend about four years to hit his stride. I suspect it took the Gotham Gal about as long. Part of this is that is how long it takes to know if you've made a good investment or not. You might know in two to three years. But by four years, it is going to be pretty clear. As these outcomes start coming in, you can start to see what is working and what is not.\nAnd \"what is working and what is not\" is not just about your investment selection. It is about the fit between you and a certain kind of entrepreneur and a certain kind of target market and a certain kind of business model. Some investors are better at investing in SAAS companies. Some are better at investing in e-commerce. Some are better at investing in mobile apps. Some investors are better at working with teams that need a lot of help. Some investors are better at working with teams that don't need any help and want you to get out of the way.\nIt is important to figure out who you are and where you fit in the startup economy before you can become a good investor. But once you do that, you can \"hit your stride\" and start investing with conviction.\nConviction is one of the most important things entrepreneurs want to see in an investor. The overhead of working with an investor who lacks conviction is just too much for an entrepreneur. It can become a major drain on them and their company. I'd rather have conviction and be wrong than have doubts and be right. Because the latter doesn't work in a relationship with an entrepreneur and you are likely to lose anyway.\nSo for those just starting out in a career as a venture capital or angel investor, I would suggest that they take their time, be patient, and build a portfolio slowly and deliberately. And pay attention to what is working for you and what is not. Over time you can build an investment thesis that works for you and that you can become known for. That is when you will hit your stride and when you can step on the gas.", "title": "Hitting Your Stride"}, {"body": "Saturday is always a tough day for me to blog. The weeks are long and I am often spent by friday afternoon. The weekend is a time for me to rejuvenate and restore. I often find the weekends bring out the best blog posts but saturday morning is always hard. In the past, I've punted by running a video on saturday morning. I think I am going to make that a more regular event. When I've got something to say, I will blog. When I don't, I'll run the most interesting video I've seen in the past week.\nToday, I'm running a twenty minute conversation between two of my favorite people in Tech, @om and @dens. This talk is mostly about Foursquare, but they do touch on the future of maps, location services, UIs, and stuff like that. I enjoyed it and I hope you do too.", "title": "Video Of The Week"}, {"body": "I learned about this cool Twilio SoundCloud hack and thought it would make a fun feature friday post.\nThe band Young Guns encourages fans to call them, leave a voicemail (powered by our portfolio company Twilio).\nThe voicemail gets transcribed and uploaded to our portfolio company SoundCloud, embedded to their site in custom SC player and band calls the person with the best voicemail.\nhttp://voicemail.weareyoungguns.com/\nI just called and called and left them a message. I hope I get the call back.", "title": "Fun Feature Friday: Voice Fan Mail"}, {"body": "Sometime over the summer, there was a discussion of analytics in the AVC comments and Shana said something like \"I would love to do a serious data analysis on AVC's analytics.\" So I reached out to Shana and told her that I would give her access to my Google Analytics and Disqus Analytics accounts and she could go crazy on the numbers. But I told her that she had to produce a post out of all of that work. She agreed and this guest post is the result of those efforts.\nOne of the things I find really hard to wrap my head around about AVC.com is that for all intents and purposes it runs like any other media site.  To me, this is my bar where I hang out, but in reality, this site functions much like many other media sites such as the Atlantic, or Refinery29.  There is content, there are analytics, and there are ways of pushing out content, there are some ads and tools to push them out, there are some tools to make the community more social, but not much else.  If AVC.com had a business model (which it doesn't, the advertising money goes to charity), it would be one similar to many content sites out there: Increase Users; Increase pageviews; Sell ads.  What makes this site unusual is that there is a large community of users, primarily driven by technology built by the team at Disqus.\nIt also leads to some interesting questions about this site in comparison to other media sites.  Most content sites are still trying to figure out the role of comments.  Do they ignore them?  Do they not have them?  Do they feature some content? Do they write about the comments?  Do they reward commenting behavior?  Does having a community make a difference to the business model of content sites?\nOn this site, it does.  Not only does it make a difference, comments here are highly correlated with unique pageviews of repeat users, uniques in general (not just for repeat users), time on site by repeat users, and time on site by everyone.\nOne half of unique pageviews over the past 9 months have been generated by repeat users.\nI wanted to see if unique pageviews of returning users was correlated with the number of comments. I used a correlation coefficient (Spearman's Rank Correlation Coefficient) which is a measure of correlation variables that behave monotonically, or in other words, the variables move up and down together. The correlation coefficient for unique pageviews generated by repeat visitors is 0.7973 to comments. This is a high correlation coefficient and suggests the two are linked.\nTo give a comparison point to explain this correlation coefficient, SEOMOZ reports for Good SEO Experiments a correlation coefficient(a linear measure of correlation) of 0.3 is considered quite good, even though 0.3 usually implies fairly low correlation.  Having a community on your site is therefore way more likely to be a factor that would generate significant traffic than SEO efforts, if we compare statistical significance.\nI also looked at the rate of change for the percent of returning users versus the percent of new users. They line up quite nicely. They have a correlation coefficient of .9387.  However, the rate of change for new users as well as repeat users is quite small.  Granted, this is a niche audience, so I'm not totally surprised.  Still, it is nice to know that total user activity is very much driven by regular user activity.\nHowever, average time on site for all users to comments is less correlative (though still significantly so), with a correlation coefficient of 0.6733.   Similarly, there is correlation coefficient of 0.6848 for average time on site for returning users versus comments.  I suspect the reason is that some people like emailing back replies, some people like to go the site to write replies, and some people like using Engagio to write replies.  Unfortunately there is no way to directly measure which people on this site are using email, Engagio, or the site itself to reply to comments.\nThe  correlation of all unique visitors is also highly correlative to comments.  (correlation coefficient =0.8413).\nThis data leads me to believe that people are in fact coming to the site not just for the posts, but for the community surrounding the posts.  People are more curious about the chatter and the interactions that come out of the posts than the post itself.  Building out community means over time you will build out a growing site.\nIf you are a web publisher/media company and you are looking at this post, having a strong commenting platform (like Disqus) is going to be essential to your long-term success as a media outlet.  Communities can be bigger drivers of traffic than Search Engine Optimization.  Having a strong moderation/community management team in place is more essential than having SEO staff in the long term, since there is a higher correlation to factors that matter to growth and ad sales (pageviews, uniques, time one site) to having community.  The reason is that people are not just on your media sites to read: They are there to interact with other readers about what they have read.  Teaching your writers and your community to stick to your site to discuss articles in depth ends up causing long-term growth.\n(some notes:)\n1)My friend Daniel Choi, a PHD Candidate in Molecular Biology/Computational Biology at Princeton, helped me understand rho based correlations. Thank you Daniel.\n2)For the sake of discussion, Disqus and Google Analytics are two different reporting tools.  GA also samples when you are looking at daily data for 9 months for a site of this size.  Please therefore take this post with a grain of statistical salt.\n3) William Mougayar was kind of enough to give me some data about Fred to see if Fred's presence in the comments matters.  It didn't make it into the post for a variety of reasons.  Thank you William, anyway.\n4) Thank you Fred for cleaning up some of the language about correlations during the editing process\n5)IRL I'm a web analyst who is job hunting for my next gig while handling some side projects.  If you like this post, feel free to get in touch)", "title": "Guest Post From Shana Carp: Communities Make Business Sense"}, {"body": "Our President gave an important speech yesterday at the UN. It was a speech about speech. Free speech. This is a topic that gets me going. I have been investing in the tools of self expression and free speech for close to twenty years now. I know how powerful they are and I also know that they can be used by haters and trouble makers just as easily as they can be used for good.\nHere at AVC, I have tried to cultivate a forum where all opinions are welcome. Even those that are hateful or hurtful to me. I let them stand. Where everyone can judge them and opine on them. The President said this at the UN and I wholeheartedly agree with it:\nAs president of our country, and commander in chief of our military, I accept that people are going to call me awful things every day,\" Mr. Obama said. \"And I will defend their right to do so.\nAnd he went on to say this:\nthe strongest weapon against hateful speech is not repression, it is more speech  -  the voices of tolerance that rally against bigotry and blasphemy, and lift up the values of understanding and mutual respect.\nThese are important values to state, to live by, and to protect. I applaud the President for expressing his beliefs on this subject. If we can export anything to the parts of the world that are just beginning their relationship with democracy, it is these ideas and the tools that make self expression possible. We must do this.", "title": "Free Speech"}, {"body": "The first great investment we made at USV was Indeed in the summer of 2005. Brad had been looking for a search engine for jobs and I saw this post on John Battelle's blog in late 2004. I forwarded it to Brad and he reached out to Paul and Rony. It took two tries before we could convince them to take our money. They had bootstrapped the company, launched the service, and were well on their way. They didn't need our money. But eventually we convinced them to take it, along with the New York Times Company and our friends at Allen & Company.\nIndeed has always been the quiet one. Nobody really talks about them. But as I have said a number of times on this blog, they are the most complete company in our portfolio. They have it all. Two world class entrepreneurs as founders. A solid management team all up and down the company. A product that is beloved and services more than 80mm people worldwide every month. An engineering team that has kept the service up with literally no down time that I can ever remember. A business model that, like Google's, is the best on the Internet. Revenues, profits, customer satisfaction, shareholder value. They built a fortress and I am just so happy to have had a front row seat watching them build it.\nThe quiet one is the one that can do a big M&A transaction over the summer without anyone finding out. The quiet one is the one that puts out the news on their blog and goes back to serving customers. The quiet one is the first great investment we made at USV and one that will always have a special place in my heart. Congrats to Paul, Rony, and the team. We will miss working with you.", "title": "Indeed"}, {"body": "Yesterday we hosted a conversation between David Kappos, the Director of the US Patent and Trademark Office, and a bunch of founders/CEOs of our portfolio companies. It was a far reaching conversation that gave me optimism that our government does realize the issues with our patent system, particularly as it relates to software and business method patents.\nThere was one thing that we discussed that is very important and needs to be publicized broadly.\nSection 18 of last year's America Invents Act provides for a \"post-grant review proceeding for review of the validity of covered business method patents.\" Here's the provision. The USPTO has interpreted that provision and it is now fully implemented.\nHere's what this means. If you are sued or threatened with a suit over a business method patent, you can submit the business method patent to the USPTO for a \"post grant review.\" If the USPTO determines that patent is overly broad or should not have been issued, it will be thrown out in its entirety.\nYou can do this as part of your defense strategy and it will cost a fraction of a litigation defense. And the USPTO is required to complete the post grant review within one year of submittal, well ahead of any trial schedule.\nSo if you have been sued or if you are sued in the future over a business method patent, you should avail yourself of this post-grant review. It is faster, less expensive, and may well result in the elimination of bogus business method patents. And that's a good thing for everyone other than the troll who is suing you.", "title": "Section 18 of the America Invents Act"}, {"body": "My favorite course in business school was Financial Statement Analysis. It was like taking a course in investigative journalism or learning how to be a police detective. The professor explained that if you look hard enough, you can learn most anything you want about a business from the numbers. I've learned that numbers themselves are not the most important thing in a business but they sure are symptoms of what is going on inside the company. And therefore, they are worth studying if you care a lot about a company.\nThis topic could be and is a full semester course at some business schools. It is a deep and rich topic that I can't cover in one single blog post. But it is also a relatively narrow skill set at its most developed levels. If you are going to be a public equity analyst, you need to understand this stuff cold and this post will not get you there.\nBut if you are an entrepreneur being handed financial statements from your bookkeeper or accountant or controller, then you need to be able to understand them and I'd like this post to help you do that. I'd also like this post help those of you who want to be more confident buying, holding, and selling public stocks. So that's the perspective I will bring to this topic.\nIn the past three weeks, we talked about the three main financial statements, the Income Statement, the Balance Sheet, and the Cash Flow Statement. This post is going to attempt to help you figure out how to analyze them, at least at a cursory level.\nIn general, I like to start with cash. It's the first line item on the Balance Sheet (it could be the first several lines if you want to combine it with short term investments). Note how much cash you have or how much cash the company you are analyzing has. Remember that number. If someone asks you how much cash you have in your business, or a business you are analyzing, and you can't answer that to the last accounting period (at least), then you failed. There is no middle ground. Cash is that important.\nThen look at how much cash the business had in a prior period. Last month is a good place to start but don't end there. Look at how much cash went up or down in the past month. Then look much farther back, at least a quarter, and ideally six months and/or a year. Calculate how much cash went up or down over the period and then divide by the number of months in the period. That's the average cash flow (or cash burn) per month. Remember that number.\nBut that number can be misleading, particularly if you did any debt or equity financings during that period (or if you paid off any debt facilities during that period). Back out the debt and equity financings and do the same calculations of average cash flow per month. Hopefully the monthly number, the quarterly average, the six-month average, and the annual average are in the same ballpark. If they are not, something is changing in the business, either for the good or the bad and you need to dig deeper to find out what. We'll get to that.\nIf cash flow is positive for all periods, then you are done with cash. If it is negative, do one more thing. Divide your cash balance by the average monthly burn rate and figure out how many months of cash you have left. If you are burning cash, you need to know this number by heart as well. It is the length of your runway. For all you entrepreneurs out there, the three cash related numbers you need to be on top of are current cash balance, cash burn rate, and months of runway.\nI generally like to go to the income statement next. And I like to lay out a few periods next to each other, ideally chronologically from oldest on the left to the newest on the right. For startups and early stage companies, a 12 month trended monthly presentation of the income statement is ideal. For more mature companies, including public companies, the current quarter and the four previous quarters are best.\nSome people like to graph the key line items in the income statement (revenue, gross margin, operating costs, operating income) over time.  That's good if you are a visual person. I find looking at the hard numbers works better for me. Note how things are moving in the business. In a perfect world, revenues and gross margins are growing faster than operating costs, and operating income (or losses) are increasing (or decreasing) faster than both of them. That is a demonstration of the operating leverage in the business.\nBut some early stage companies either have no revenue or are investing in the business faster than they are growing revenue. That is a sound strategy if the investments they are making are solid ones and if they have a timeline laid out during which they'll do this. You can't do that forever. You'll run out of cash and go out of business.\nFrom this analysis, you may see why the business is burning cash or burning cash more quickly or less quickly. You may see why the business is growing its cash flow rapidly. I am most comfortable when the monthly operating income (or losses) of a business are roughly equal to its cash flow (or cash burn). This does not have to be the case for the business to be healthy but it means the business has a relatively simple economic architecture, which is always comforting. From Enron to Lehman Brothers, we've learned that complex business architectures are hard to analyze and easy to manipulate.\nOne thing that bears mentioning here are \"one time items\" on the Income Statement. They make your life harder. If you go back to the Income Statement post and look at Google's statement, you'll see that in the first year of their presentation Google made a one-time contribution to the Google Foundation. That depressed earnings in that period. You need to back that one time charge out for a consistent presentation, but you also need to be somewhat suspicious of one-time charges. Companies can try to bury ongoing expenses in one-time charges and inflate their earnings. You don't see that much in startups but you do in public companies and it's a \"red flag\" if a company does it too often.\nIf the monthly operating income (after backing out one-time charges) doesn't come close to the monthly cash burn rates, then something is going on with the balance sheet of the business. Many of these differences are normal for certain businesses. My friend Ron Schreiber told me about a software distribution business he and his partner Jordan Levy ran in the mid 80s. They would buy software from Microsoft, Lotus, and others in bulk and sell it in small quantities to mom and pop businesses. Microsoft and Lotus wanted to be paid upfront when the shipped the software but the mom and pop businesses were running on fumes and could not pay until they sold the software. So Ron's business, called Software Distribution Services (of course), was always out of cash. In Ron's words, they were a bank and a distribution company and weren't getting paid for the banking part of their business. All during this time the revenue line and the operating income line was growing fast and furious as desktop software went from a niche business to a mainstream business. Eventually Ron and Jordan had to sell their business to Ingram, a large book distributor who had the financial resources to provide the \"banking services\". They made a nice hit on that company, but not anything like what Microsoft and Lotus did even though they grew their topline just as fast as their suppliers.\nRon and Jordan's business was \"working capital intensive.\" Working capital is the non cash current assets and liabilities of the business. When they grow rapidly in relation to revenues, it means you are financing other parts of the food chain in your industry and that's a great way to run out of cash.\nSo if monthly income and monthly cash flow aren't in the same ballpark, look at the changes in working capital month over month. We went over this a bit last week in preparing the cash flow statement. If working capital is the culprit soaking up the cash, you need to look at two things.\nThe first is if the revenues are real. A great way to inflate revenues is to \"ship product\" to people who aren't going to pay you. A company that is doing that is operating fraudently so you don't see it very often. But if someone is doing this, cash will be going down while profits are steady and accounts receivable are growing rapidly. I always look for that in a company that is supposed to be profitable but is sucking cash.\nThe second is the availability of working capital financing. If a business can finance its working capital needs inexpensively, then it can operate successfully with this business model. In times when debt is flowing freely, these can be good businesses to operate. When cash is tight, they are not.\nThe final thing to look for on the balance sheet is capex.  If a business is operating profitably, and growing profits, but its capex line is growing faster than profits, it's got the potential for problems. Hosting companies are an example of a set of companies that might be in this situation. Again, the availability of financing is the key. Local cable operators operated profitably for years with big negative cash flows because of capex. The financial markets like the monopolies these busineses were granted and consistently provided them with financing to buy more capex. But if that party ends, it can be painful.\nThis post is three pages long in my editor so it's time to stop. There is more to discuss on this topic so I'd like to know if I did this topic justice for most of you or if you'd like another post that digs a little deeper. My preference is to move on because I'm getting a bit tired of writing about accounting every Monday, but most of all I want to cover the stuff you want to learn or freshen up on. So let me know.", "title": "MBA Mondays From The Archive: Analyzing Financial Statements"}, {"body": "I was early for a meeting on friday afternoon and found myself sitting in a chat between a University President and members of the faculty. One of the faculty members asked the President about the \"education bubble.\" The President gave his thoughts on the topic and then unexpectedly turned to me and asked what I thought.\nI am a product of student loans. I got an engineering degree at MIT and a MBA at Wharton and paid for both of those degrees with a mix of family support, tuition credits for working while in school, and the maximum amount student loans I could take out. I spent much of my 20s paying those loans back. I remember when I made my last payment. It was a moment of great pride.\nI have made a tremendous return on my two degrees. Those student loans were an investment in me and they paid off big time. For the right student and the right institutions, there is no better investment that society can make than to pay for a high quality college and graduate education. Not only have I paid back the loans, but the Gotham Gal and I have made and continue to make generous gifts to a host of educational institutions. We will pay back the investments made in us many times over.\nWhen it came time for our children to go to school, we have paid for the highest quality education we could find for them. We are fortunate that we did not have to take out loans to pay for those tuition bills. But if that were not the case, I am confident we would have borrowed the money to help them attend those institutions. So we are big believers in the value of a higher education and we have invested in it for ourselves and our children.\nI told the University President and the faculty members all that. But I also told them that I am deeply concerned that about the cost of a high quality education and the fact that it is getting out of reach for many. And I told them that I am not sure the return on the investment is as high as it once was for many degrees. And finally, I told them that too many students are walking out of college with a student loan burden that is crushing and that they can't and won't pay back.\nSo how you reconcile these two opposing views and what can we do about it?\nTechnology can help. But it is a tool not a panacea. Given the choice, most of us are still going to opt to send our children to MIT instead of the University of Phoenix. MIT and the other leading higher education institutions will increasingly use technology to improve the education they deliver and do so more efficiently. This may help alleviate the ever rising costs.\nBut we also need to get more creative about the financing of higher education. We should measure the return on investment students are getting from the institutions they attend and the degrees they obtain and tie the amount of loans they can get to the returns they are likely to achieve. Students that attend institutions that can deliver higher returns should be able to take our larger loans.\nRepayment terms need to change as well. Loan repayments should be capped at a percentage of current income. I know a woman who has been out of graduate school for more than a decade who dedicates one of her two paychecks a month to paying back her student loans. She is spending half of her take home income on her student loans. That is nuts.\nBubbles are driven by easy money that drives irrational behavior. Our student loan policies have been doing some of that. We can and should change our policies to force more rational decisions in the purchase of higher education in this country.\nBut we cannot forget the power of a high quality education to put our children on the best possible path in their lives. I am an example of what such an education can do for someone. And I know that there are many others out there just like me. We need to figure out how to reform the system in ways that don't cut that path off for students like I was thirty years ago.", "title": "Student Loans and the Education Bubble"}, {"body": "Paul Graham has penned an longish and excellent essay in which he postulates that growth is the single defining characteristic of startups and the thing that all entrepreneurs must focus on. Paul is slowly but surely building a body of writing on startups that is as good as anything that has ever been written on the topic. And this essay on growth is one of the gems. This is another gem. There are quite a few of them.\nI don't always agree with Paul and I see the world a bit differently than he does. But on the topic of growth, I could not agree more. Once we determine that a company fits into our investment thesis, we then turn to the team and traction to figure out if it's something we want to invest in. Traction is another way of saying growth.\nOne thing that Paul did not touch on is the difference between organic and sustainable growth and temporary stimulated growth. Things like gaming Facebook's open graph can temporarily stimulate growth that is not sustainable long term. Investors can be faked out by things like that. Gaming Google's search algorithms is another way that has been done in the past. When we look at growth, we look for authentic, organic, and sustainable growth that is not overly dependent on a single source, particularly a source the startup doesn't control. That takes some experience to detect. We've messed up there as have most investors.\nSustainable and organic growth that can continue for five or ten years unabated will produce extraordinary returns. I look back at Etsy when we invested in it in the spring of 2006, about a year after they had launched. The company had just crossed $200,000 a month of gross merchandise value (GMV), up from $1000 of GMV in the month they launched in June 2005. They had grown 200x in less than a year after their launch. I am not going to reveal Etsy's current financials but it is safe to say that they have grown more than 200x again since our initial investment. And at the rate they are growing, they could grow another 10x in the next five years. Those are some big numbers and that is how investor generate spectacular returns investing startups.\nAnd that is how entrepreneurs and the founding team and the management team can generate significant value for themselves as well. When thinking about startups, growth is good.", "title": "Growth"}, {"body": "We've all had that reaction when seeing that a certain patent was issued - \"how the hell did they get a patent on that?\". Well now we can have fun outing those ridiculous patent applications before they get issued.\nYesterday our portfolio company Stack Exchange launched a new Stack powered community called Ask Patents. Here's how Stack CEO Joel Spolsky describes it:\nAsk Patents is a new Stack Exchange site launching today that allows anyone to participate in the patent examination process. It's a collaborative effort, supported by Stack Exchange, the US Patent and Trademark Office, and the Google Patent Search team. It's very exciting, because it is opening up a process that has been conducted behind closed doors for over 200 years.\nI don't really need to discuss how badly our patent process is broken to here. We've discussed it ad naseum.\nWhat we can and should discuss is how an open collaborative crowd based approach to patent examination can improve the process. I am hopeful that it will. And I am thrilled that the USPTO opted to partner with Stack Exchange to run this process. Stack's sites, rules, and processes take a bit of getting used to. They are geeky for sure. But they produce very high quality collaborative debates on questions with definitive answers that the community resolves and the quality of the results they get from this process is extremely high.\nThis is not like asking the Yahoo Answers community to do patent examination. That would be laughable. This is a much more serious effort, based on \"prior art\". Joel explains:\nAsk Patents is a collaborative effort, neatly tagged by keywords and classification, and searchable by patent application number. It is inspired by a research project called Peer To Patent, run out of New York Law School. That pilot project, created by Professor Beth Noveck, proved very successful at identifying prior art that the USPTO wouldn't otherwise have known about.\nSo instead of our regular fun friday routine, I'm asking everyone to go spend a few minutes on Ask Patents and see if you might enjoy becoming a part time patent examiner yourself. I am headed there now.", "title": "Fun Friday: Outing Bad Patents"}, {"body": "There are many themes that grace this page from time to time. Two of the most common are the rise of startup communities and the role that the Internet can play in allowing society to governing itself. And there are two books out this week that are must reads on these two topics. Further and in full disclosure, they are written by two very good friends. No conflict no interest as it were.\nLet's start with Startup Communities by Brad Feld. I met Brad in 1996. He had just moved to Boulder Colorado and was going to help build a startup community there by building a market leading VC firm in Boulder. Sounds audacious? Yes. But he did it. As I was working on the same idea for the past sixteen years in NYC, I was able to watch a parallel universe forming in Boulder with Brad at the center.  In Startup Communites, Brad tells us what he's learned from that experience and how the same thing can be done elswhere. If you want to create a Boulder or NYC tech scene in your community, this is your roadmap, bible, and textbook. You can get it on Kindle today and or pre-order the book for delivery next week.\nOn to Future Perfect by Steven Johnson. Back in the Spring, Steven emailed me a draft of this book. I put the PDF on my Kindle and started reading. I found myself yelling Yes, Yes, Yes as I was making my way through the chapters. I know most, if not all, of the stories in this book. I have been involved in some of them and have followed the others closely. Those stories tell me that there is a \"case for progress in a networked age\" and Steven makes that case as only he can, by telling the stories brilliantly and then wrapping the meaning of them together in a crisp, cohesive, and easy to understand narrative that leaves you with a framework to take out in the world. You can get Future Perfect on Kindle or in hardback right now as it was published earlier this week.\nThe comment thread on my Get Out The Vote post a couple days ago was downright depressing and full of anger and cynicism. So for all of you and everyone else, here is a short 3 min video from Steven talking about the ideas in his book and where they are going. If you need a shot of optimism this morning, watch it.", "title": "Two Must Read Books For The AVC Community"}, {"body": "I am in my second decade as a board member on several companies. It doesn't happen often in the VC business, at least my VC business, because I get off the boards of companies that go public or are headed there shortly. The percentage of portfolio companies that don't shut down, sell, or go public within a decade of their initial VC investment is low. But the ones that make it into their second decade without an exit are special in many ways. They have staying power, an ability to evolve and grow, and a culture that is built to last.\nThe company in that group that this community is most familiar with is Return Path. Executives from Return Path, including its founder and CEO Matt Blumberg, have written guest posts here a few times. Return Path has reinvented itself three or four times in its history. And yesterday they did it again. They are now the global leader in email intelligence. They actually have been that for quite a while. But they gave themselves that label yesterday.\nWhat is email intelligence? Well in Matt's words, it is:\n[Emailers] are struggling with two core problems that complicate their decision making: They have access to so much data, they can't possibly analyze it fast enough or thoroughly enough to benefit from it; and too often they don't have access to the data they really need.\nMeanwhile they face new challenges in addition to the ones email marketers have been battling for years. It's still hard to get to the inbox, and even to monitor how much mail isn't getting there. It's still hard to protect brands and their customers from phishing and spoofing, and even to see when mail streams are under attack. And it's still hard to see engagement measurements, even as they become more important to marketing performance.\nOur solution to these problems is email intelligence. Email intelligence is the combination of data from across the email ecosystem, analytics that make it accessible and manageable, and insight that makes it actionable.\nIn connection with the new reformation of their company's mission and position in the market, Return Path launched or relaunched three products yesterday. The one that is truly groundbreaking in my opinion is called Inbox Insight. Think of its as ComScore for Email. If you want to know how your mail is doing compared to your competitors across a number of key metrics like engagement, inbox placement, spam complaint rates, etc, you can learn all of that and more with Inbox Insight.\nStarting, building, and running companies is hard work. I know this because I see it in the eyes and wrinkles of the people I work with every day. But building a lasting, evolving, growing, and market leading company is a terrific feat. I want to congratulate Matt and the team at Return Path, most of whom have been there as long as I have, on a big day yesterday and a great new tagline, mission, and market position. Well done.", "title": "Email Intelligence"}, {"body": "The \"net native\" generation can be and should be an important political force. These young people grew up with the Internet and they understand how to leverage it in all aspects of their lives. And they understand the importance of protecting the Internet and the concept of Internet Freedom.\nBut we have to make sure they are registered to vote and that they do indeed go out and vote. That's where The Internet Votes comes in. Over the next week, the folks at Fight For The Future and Personal Democracy Media will be rolling out a series of tools that encourage everyone, but particularly the net natives, to register to vote and then in turn to get out and vote. This effort is non-partisan. There is nothing in this campaign that has anything to do with who you should vote for and why. It's all about voter activation.\nThe first of these tools, a voter registration widget, is available now. I am running it on the right sidebar of AVC, under the ad unit. You can get it for your blog here.\nAs more of these tools launch, I will blog about them, use them, and encourage all of you to do the same. Those who understand the power of the open internet, use it in their lives, and value it as a positive force for society must vote and make their voices heard if they want our elected officials to value these principals as well.", "title": "Getting Out The Vote"}, {"body": "Continuing this month's practice of pulling an accounting related blog post from the archives, this week we feature the post on Cash Flow. The Income Statement and Balance Sheet get more attention, but there is nothing more important in keeping your business afloat than Cash Flow.\nThis week on MBA Mondays we are going to talk about cash flow. A few weeks ago, in my post on Accounting, I said there were three major accounting statements. We've talked about the Income Statement and the Balance Sheet. The third is the Cash Flow Statement.\nI've never been that interested in the Cash Flow Statement per se. The standard form of a cash flow statement is a bit hard to comprehend in my opinion and I don't think it does a very good job of describing the various aspects of cash flow in a business.\nThat said, let's start with the concept of cash flow and we'll come back to the accounting treatment.\nCash flow is the amount of cash your business either produces or consumes in a given period, typically a month, quarter, or year. You might think that is the same as the profit of the business, but that is not correct for a bunch of reasons.\nThe profit of a business is the difference between revenues and expenses. If revenues are greater than expenses, your business is producing a profit. If expenses are greater than revenues, your business is producing a loss.\nBut there are many examples of profitable businesses that consume cash. And there are also examples of unprofitable businesses that produce cash, at least for a period of time.\nHere's why.\nAs I explained in the Income Statement post, revenues are recognized as they are earned, not necessarily when they are collected. And expenses are recognized as they are incurred, not necessarily when they are paid for. Also, some things you might think of as expenses of a business, like buying servers, are actually posted to the Balance Sheet as property of the business and then depreciated (ie expensed) over time.\nSo if you have a business with significant hardware requirements, like a hosting business for example, you might be generating a profit on paper but the cash outlays you are making to buy servers may mean your business is cash flow negative.\nAnother example in the opposite direction would be a software as a service business where your company gets paid a year in advance for your software subscription revenues. You collect the revenue upfront but recognize it over the course of the year. So in the month you collect the revenue from a big customer, you might be cash flow positive, but your Income Statement would show the business operating at a loss.\nCash flow is really easy to calculate. It's the difference between your cash balance at the start of whatever period you are measuring and the end of that period. Let's say you start the year with $1mm in cash and end the year with $2mm in cash. Your cash flow for the year is positive by $1mm. If you start the year with $1mm in cash and end the year with no cash, your cash flow for the year is negative by $1mm.\nBut as you might imagine the accounting version of the cash flow statement is not that simple. Instead of getting into the standard form, which as I said I don't really like, let's talk about a simpler form that gets you to mostly the same place.\nLet's say you want to do a cash flow statement for the past year. You start with your Net Income number from your Income Statement for the year. Let's say that number is $1mm of positive net income.\nThen you look at your Balance Sheet from the prior year and the current year. Look at the Current Assets (less cash) at the start of the year and the Current Assets (less cash) at the end of the year. If they have gone up, let's say by $500,000, then you subtract that number from your Net Income. The reason you subtract the number is your business used some of your cash to increase its current assets. One typical reason for that is your Accounts Receivable went up because your customers are taking longer to pay you.\nThen look at your Non-Current Assets at the start of the year and the end of the year. If they have gone up, let's say by $500k, then you also subtract that number from your Net Income. The reason is your business used some of your cash to increase its Non-Current Assets, most likely Property, Plant, and Equipment (like servers).\nAt this point, halfway through this simplified cash flow statement, your business that had a Net Income of $1mm produced no cash because $500k of it went to current assets and $500k of it went to non-current assets.\nLiabilities work the other way. If they go up, you add the number to Net Income. Let's start with Current Liabilities such as Accounts Payable (money you owe your suppliers, etc). If that number goes up by $250k over the course of the year, you are effectively using your suppliers to finance your business. Another reason current liabilities could go up is Deferred Revenue went up. That would mean you are effectively using your customers to finance your business (like that software as a service example earlier on in this post).\nThen look at Long Term Liabilities. Let's say they went up by $500k because you borrowed $500k from the bank to purchase the servers that caused your Non-Current Assets to go up by $500k. So add that $500k to Net Income as well.\nNow, the simplified cash flow statement is showing $750k of positive cash flow. But we have one more section of the Balance Sheet to deal with, Stockholders Equity. For Stockholders Equity, you need to back out the current year's net income because we started with that. Once you do that, the main reason Stockholders Equity would go up would be an equity raise. Let's say you raised $1mm of venture capital during the year and so Stockholder's Equity went up by $1mm. You'd add that $1mm to Net Income as well.\nSo, that's basically it. You start with $1mm of Net Income, subtract $500k of increased current assets, subtract $500k of increased non-current assets, add $250k of increased current liabilities, add $500k of increased long-term liabilities, and add $1mm of increased stockholders equity, and you get positive cash flow of $1.75mm.\nOf course, you'll want to check this against the cash balance at the start of the year and the end of the year to make sure that in fact cash did go up by $1.75mm. If it didn't, then you have to go back and check your math.\nSo why would anyone want to do the cash flow statement the long way if you can simply compare cash at the start of the year and the end of the year? The answer is that doing a full-blown cash flow statement tells you a lot about where you are consuming or producing cash. And you can use that information to do something about it.\nLet's say that your cash flow is weak because your accounts receivable are way too high. You can hire a dedicated collections person. You can start cutting off customers who are paying you too late. Or you can do a combination of both. Bringing down accounts receivable is a great way to improve a business' cash flow.\nLet's say you are spending a boatload on hardware to ramp up your web service's capacity. And it is bringing your cash flow down. If you are profitable or have good financial backers, you can go to a bank and borrow against those servers. You can match non-current assets to long-term liabilities so that together they don't impact the cash flow of your business.\nLet's say your current liabilities went down over the past year by $500k. That's a $500k reduction in your cash flow. Maybe you are paying your bills much more quickly than you did when you started the business and had no cash. You might instruct your accounting team to slow down bill payment a bit and bring it back in line with prior practices. That could help produce better cash flow.\nThese are but a few examples of the kinds of things you can learn by doing a cash flow statement. It's simply not enough to look at the Income Statement and the Balance Sheet. You need to understand the third piece of the puzzle to see the business in its entirety.\nOne last point and I am done with this week's post. When you are doing projections for future years, I encourage management teams to project the income statement first, then the cash flow statement, and then end up with the balance sheet. You can make assumptions about how the line items in the Income Statement will cause the various Balance Sheet items to change (like Accounts Receivable should be equal to the past three months of revenue) and then lay all that out as a cash flow statement and then take the changes in the various items in the cash flow statement to build the Balance Sheet. I like to do that in monthly form. We'll talk more about projections next week because I think this is a very important subject for startups and entrepreneurial management teams to wrap their heads around.", "title": "MBA Mondays From The Archives: Cash Flow"}, {"body": "We see a lot of startups who want to build networks but they start by connecting with existing networks and providing utility that is cross network. Aggregation is a very common example of this. Cross posting is another.\nI am certain that these cross network utilities can become good businesses but I wonder if they can become networks. We debate this a lot inside USV. I am in the doubter camp.\nI'd like to explore this a bit today with all of you. If the initial utility of an app is to connect to a bunch of networks, collect information, present it, and then let the user engage with one or more of those networks, what incentive is there for the user to engage directly with other users of the app and help build a network inside of it?\nLet's look at a few examples.\nTake Flipboard. It is an excellent app. They innovated on the consumption interface in mobile and they present media and social media in an easy to consume and beautiful way. But is it a network and will it ever be?\nTake FriendFeed. It was possiby the best UI for social media engagement ever created. But, because they allowed people to pull in content from and engage with other networks, it never really built up a network of its own. It could have taken on Facebook and Twitter. It was a much better Google+. But it sold to Facebook for what has now turned into a lot of money, but it did not build a sustainable network of its own.\nTake Oodle. It pulls listings from lots of marketplaces, including Craigslist, eBay, Facebook, and showcases them in an excellent UI. But is it a marketplace itself? I don't think so.\nThere are a few examples I can think of where cross network utility has built a semblance of a network. Hacker News aggregates content across networks but by providing its own engagement platform, they have built a network. Reddit aggregates content across networks but because of the strong community elements in the platform, they have built a network.\nSo clearly it can be done, but I am struggling to find a lot of examples where building on top of networks, instead of building your own, has resulted in a large network of highly engaged users. I'd love to hear more examples of that. Because this is an issue that keeps presenting itself to us and we are struggling with it.", "title": "Cross Network Utility and Networks"}, {"body": "I've written a bit about our move from landline telephony to VOIP telephony in our family. We use a cloud based VOIP PBX called Onsip and we have ported all of our land lines to their cloud based system. We have several homes on one Onsip account and our total phone bill including international calls, across multiple homes, is generally $100/month or less. It's fantastic.\nBut we have struggled to find the perfect phone handsets. We like wireless handsets that have a small charging cradle and nothing else. We sometimes connect headsets to them and sometimes not.\nWe've tried a bunch of vendors but this spring we finally landed on the answer. It's a Panasonic DECT system called the KX-TGP500. It looks like this:\nThe black box is called a gateway and that is what you connect to your home network. It connects via the Internet to your SIP provider, in our case Onsip. It's about the size of a CD jewel case and it sits easily underneath a desk somewhere. The handsets connect wirelessly to the gateway.\nThe range is very good. We get good connectivity a floor up and down and throughout a 3000sf space.\nThe handsets look nice, are not too large, and have good build quality. And they appear to be very reliable, although we've only been using them for four or five months. You can get additional handsets for the gateway.\nHere's a review of the system I found on Amazon. I agree with it completely:\n3 simultaneous calls and up to 6 cordless handsets, perfect for small business or home office.\nRange and call quality is amazing. All the basic features: Speakerphone, Transfer, Intercom, Message Waiting Indicator, etc.\nSetup was easy, since our VoIP provider (voiSip) was able to do it remotely in about 2 minutes.\nIf you have a VOIP provider and are looking for a new SIP phone, I strongly recommend this Panasonic phone. If you are still on a traditional land line carrier and are getting bilked, I strongly suggest you go VOIP.", "title": "Panasonic KX-TGP500: A Great Wireless SIP Phone"}, {"body": "Google Chrome on the Jelly Bean version of Android is a joy to use, particularly on the 7\" screen on the Nexus 7. I do almost all my web reading on that device now. Actually I do almost everything other than blogging on that device now, but I digress.\nOne of my favorite features in Chrome for Android is something called \"link preview.\" When you touch a part of a web page with a lot of links on it, you get a popup that looks like this:\n[image credit: http://www.mobilexweb.com/wp-content/uploads/2012/02/links.png]\nThat popup allows you to select the exact link you want. It is awesome.\nHowever, it doesn't work on all websites. I am not entirely sure what is required on the website side to power this feature, but, for example, I can't get this feature to work on Hacker News where it would be awesome. It's entirely possible that I am doing something wrong. If so, I'd love to know what.\nBut this works on most websites I use and I have found it to be a very handy feature. I suspect it will become standard on mobile browsers, particularly on smartphones.\nNicely done Google.", "title": "Feature Friday: Link Preview"}, {"body": "The Gotham Gal wrote a post on monday in her Woman Entrepreneur Mondays series on Elizabeth Ormesher who is building a startup called Everpurse. She is starting with a Kickstarter project and attempting to raise $100,000. Here's the video explaining her idea:\nI bring this up because apparently Apple thinks that wireless charging is not easier. I would beg to differ. I think wireless charging is the future. And I think we will make more progress with wireless charging faster than we will increasing battery life, at least in the near term.\nI just backed the Everpurse project (no reward for me) because I love the idea and I love the concept of wireless charging.", "title": "Wireless Charging"}, {"body": "After School Programming\nI remember when I was in high school. A friend of mine and I stayed after school and built a rudimentary football game on a TRS80 using Basic. It was the first actual coding I had ever done. I didn't get into more serious stuff until college.\nI honestly can't remember if we had a teacher supervising us or not. I don't even remember the name of my friend who I did this with. The whole thing is fuzzy. It was almost 35 years ago.\nBut those fuzzy memories came back into focus for a second yesterday when I saw that our portfolio company Codecademy launched After School Programming Clubs . Like its Code Year initiative , After School Programming Clubs is a packaging innovation more than anything else. It takes the core Codecademy software learning tools and packages them up so that students and teachers can organize after school programming clubs.\nAlthough Codecademy now supports a number of languages, they are using their Javascript and HTML stuff for After School Programming Clubs. Here's a snapshot of the idea:\nIf you have students or teachers in your life that would want to create an After School Programming Club, send them here to get started.", "title": "After School Programming"}, {"body": "Last month I posted two back to back suggestions for industry self regulation on the issue of copyrights and the Internet. The first was a competitive market for third party whitelist and blacklists. The second was \"fast, fair, and frictionless content licensing on the Internet.\"\nI am seeing signs that both models are emerging, slowly, but surely.\nIn the case of frictionless content licensing, I wrote:\nI think it will be even harder to get the content industry to build instantaneous real-time self service licensing systems for their content.\nBut happily, the photography industry is proving me wrong. Yesterday, Getty Images announced something they call PicScout Image IRC. Not the most memorable name. But it is \"instantaneous real-time self service licensing on the Internet.\"\nHere's how it works. When an image is posted to your service, you send the image to them via their API, they fingerprint it in real time, check the fingerprint against their database of rights managed photographs that are out there, and then tell you if the image is licensable, must be taken down because its not licensable for the Internet, or if they don't have it in their database, then you keep it up under DMCA. And they handle all the billing for the licensable content. If you don't want to pay licenses for images posted to your service, you can use their service just to take down all images that are under license.\nIt is a lot like what Audible Magic does for the music industry or what Content ID does for YouTube, in terms of rapidly identifying the content and determining if it is infringing on a license or not. But PicScout goes one step further and provides an instant license to the content if the application wants one. That's a big deal and is the very step I think the content industry needs to take to tackle copyright infringement on the Internet. It is not enough to say something is infringing. The right thing is to say, \"that is infringing, but here is a license\" and to do that in real-time.\nAny developer can use this PicScout Image IRC API. No meetings required. No lawyers required. Fast frictionless licensing on the Internet. I really like it.", "title": "Fast, Fair, and Frictionless Content Licensing On The Internet (continued)"}, {"body": "Continuing the visit back in time to the MBA Mondays Archives, today we are going to rerun the post on the Balance Sheet, which is a financial snapshot into the health of your business.\nToday on MBA Mondays we are going to talk about the Balance Sheet.\nThe Balance Sheet shows how much capital you have built up in your business.\nIf you go back to my post on Accounting, you will recall that there are two kinds of accounts in a company's chart of accounts; revenue and expense accounts and asset and liability accounts.\nLast week we talked about the Profit and Loss statement which is a report of the revenue and expense accounts.\nThe Balance Sheet is a report of the asset and liability accounts. Assets are things you own in your business, like cash, capital equipment, and money that is owed to you for products and services you have delivered to customers. Liabilities are obligations of the business, like bills you have yet to pay, money you have borrowed from a bank or investors.\nHere is Google's balance sheet as of 12/31/2009:\nLet's start from the top and work our way down.\nThe top line, cash, is the single most important item on the balance sheet. Cash is the fuel of a business. If you run out of cash, you are in big trouble unless there is a \"filling station\" nearby that is willing to fund your business. Alan Shugart, founder of Seagate and a few other disk drive companies, famously said \"cash is more important than your mother.\" That's how important cash is and you never want to get into a situation where you run out of it.\nThe second line, short term investments, is basically additional cash. Most startups won't have this line item on their balance sheet. But when you are Google and are sitting on $24bn of cash and short term investments, it makes sense to invest some of your cash in \"short term instruments\". Hopefully for Google and its shareholders, these investments are safe, liquid, and are at very minimal risk of loss.\nThe next line is \"accounts receivable\". Google calls it \"net receivables' because they are netting out money some of their partners owe them. I don't really know why they are doing it that way. But for most companies, this line item is called Accounts Receivable and it is the total amount of money owed to the business for products and services that have been delivered but have not been collected. It's the money your customers owe your business. If this number gets really big relative to revenues (for example if it  represents more than three months of revenues) then you know something is wrong with the business. We'll talk more about that in an upcoming post about financial statement analysis.\nI'm only going to cover the big line items in this balance sheet. So the next line item to look at is called Total Current Assets. That's the amount of assets that you can turn into cash fairly quickly. It is often considered a measure of the \"liquidity of the business.\"\nThe next set of assets are \"long term assets\" that cannot be turned into cash easily. I'll mention three of them.  Long Term Investments are probably Google's minority investments in venture stage companies and other such things. The most important long term asset is \"Property Plant and Equipment\" which is the cost of your capital equipment. For the companies we typically invest in, this number is not large unless they rack their own servers. Google of course does just that and has spent $4.8bn to date (net of depreciation) on its \"factory\". Depreciation is the annual cost of writing down the value of your property plant and equipment. It appears as a line in the profit and loss statement. The final long term asset I'll mention is Goodwill. This is a hard one to explain. But I'll try. When you purchase a business, like YouTube, for more than it's \"book value\" you must record the difference as Goodwill.  Google has paid up for a bunch of businesses, like YouTube and Doubleclick, and it's Goodwill is a large number, currently $4.9bn. If you think that the value of any of the businesses you have acquired has gone down, you can write off some or all of that Goodwill. That will create a large one time expense on your profit and loss statement.\nAfter cash, I believe the liability section of the balance sheet is the most important section. It shows the businesses' debts. And the other thing that can put you out of business aside from running out of cash is inability to pay your debts. That is called bankruptcy. Of course, running out of cash is one reason you may not be able to pay your debts. But many companies go bankrupt with huge amounts of cash on their books. So it is critical to understand a company's debts.\nThe main current liabilities are accounts payable and accrued expenses. Since we don't see any accrued expenses on Google's balance sheet I assume they are lumping the two together under accounts payable. They are closely related. Both represent expenses of the business that have yet to be paid. The difference is that accounts payable are for bills the company receives from other businesses. And accrued expenses are accounting entries a company makes in anticipation of being billed. A good example of an accounts payable is a legal bill you have not paid. A good example of an accrued expense is employee benefits that you have not yet been billed for that you accrue for each month.\nIf you compare Current Liabilities to Current Assets, you'll get a sense of how tight a company is operating. Google's current assets are $29bn and its current liabilities are $2.7bn. It's good to be Google, they are not sweating it. Many of our portfolio companies operate with these numbers close to equal. They are sweating it.\nNon current liabilities are mostly long term debt of the business. The amount of debt is interesting for sure. If it is very large compared to the total assets of the business its a reason to be concerned. But its even more important to dig into the term of the long term debt and find out when it is coming due and other important factors. You won't find that on the balance sheet. You'll need to get the footnotes of the financial statements to do that. Again, we'll talk more about that in a future post on financial statement analysis.\nThe next section of the balance sheet is called Stockholders Equity. This includes two categories of \"equity\". The first is the amount that equity investors, from VCs to public shareholders, have invested in the business. The second is the amount of earnings that have been retained in the business over the years. I'm not entirely sure how Google breaks out the two on it's balance sheet so we'll just talk about the total for now. Google's total stockholders equity is $36bn. That is also called the \"book value\" of the business.\nThe cool thing about a balance sheet is it has to balance out. Total Assets must equal Total Liabilities plus Stockholders Equity. In Google's case, total assets are $40.5bn. Total Liabilities are $4.5bn. If you subtract the liabilities from the assets, you get $36bn, which is the amount of stockholders equity.\nWe'll talk about cash flow statements next week and the fact that a balance sheet has to balance can be very helpful in analyzing and projecting out the cash flow of a business.\nIn summary, the Balance Sheet shows the value of all the capital that a business has built up over the years. The most important numbers in it are cash and liabilities. Always pay attention to those numbers. I almost never look at a profit and loss statement without also looking at a balance sheet. They really should be considered together as they are two sides of the same coin.", "title": "MBA Mondays From The Archives: The Balance Sheet"}, {"body": "Photosharing is one of the killer apps of the Internet.\nFlickr, Facebook, and Instagram have all been built on this one simple, but killer, feature.\nSo I figured we'd have some fun today and take advantage of a cool Disqus feature at the same time.\nI will start out by sharing a photo that I took that I am proud of.\nAnd then all of you can share a photo with me and everyone else in the comments. For those who aren't Disqus regulars, you do that by clicking on this button in the comment box.\nEnjoy.\nThis is the computer lab at The Academy For Software Engingeering, which opened yesterday. I was there to welcome the students and I was just so inspired when I walked into this room that I took out my Android and snapped this photo and posted it to Instagram, Tumblr, and Foursquare. Now I am posting it here.", "title": "Fun Friday: Photos"}, {"body": "One of my favorite bloggers and thinkers about social media, Anil Dash, has a blog post up on Medium titled You Can't Start the Revolution from the Country Club. Go read it because he's talking about some important stuff.\nIn his post Anil observes that in many of the most interesting new social media services, there is a sense of exclusivity built into the experience. A velvet rope as it were. And in many cases, this is being done to produce signal instead of noise, to make the consumption experience easier, and to produce \"quality content.\" Anil calls bullshit on that. And so do I.\nI have learned the power of inclusivity from writing this blog and watching this community evolve. Everyone is welcome here. Everyone can comment. Nobody's comments get nuked unless they are spam or hate. And I have a very high standard for hate. The community can and does police this place. And that allows anyone to come in here and be a regular. And that is what has created the magic.\nIf you look at some of the best communities on the web, like reddit for example, they all follow this approach. It makes for a noisy and messy experience. But it works and it scales.\nThis is my basic argument for free as a business model. Once you insert money into the equation, you are excluding important voices. Once you insert exclusivity into the quality model, you are excluding important voices.\nSome of these \"country clubs\" as Anil calls them may succeed. But they don't inspire me. They don't invite me (in the behavior sense of that word). I'll hang out in public if you don't mind. It suits me.", "title": "Inclusivity"}]